
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1.1 Go语言创世纪 · Go语言高级编程</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">


    
    <link rel="next" href="ch1-02-hello-revolution.html" />
    
    
    <link rel="prev" href="readme.html" />
    

    </head>
    <body>
        
<div class="gb-page-wrapper">
    <header class="gb-page-header">
        <div class="container">
        
            <a href=".." class="logo">
                <img src="../gitbook/images/logo/64.png">
                <h1>Go语言高级编程</h1>
            </a>

            

            <div class="page_search_block">
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                
                <a href="ch1-02-hello-revolution.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-right"></i>
                </a>
                
                
                <a href="readme.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-left"></i>
                </a>
                
            
            </div>
        
        </div>
    </header>

    <div class="gb-page-body">
        <div class="gb-page-inner">
            <div class="container">
                <div class="row">
                    <div class="col-md-3">
                        



    
    <div class="panel panel-default ">
        

        <div class="list-group">
            
    
        
        <a href="../" class="list-group-item ">
        

            

            

            Introduction

        
        </a>
        

        
    
        
        <a href="readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-down"></i>
            

            第1章 语言基础

        
        </a>
        

        
        
    
        
        <a href="ch1-01-genesis.html" class="list-group-item active">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            1.1 Go语言创世纪

        
        </a>
        

        
    
        
        <a href="ch1-02-hello-revolution.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            1.2 Hello, World 的革命

        
        </a>
        

        
    
        
        <a href="ch1-03-array-string-and-slice.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            1.3 数组、字符串和切片

        
        </a>
        

        
    
        
        <a href="ch1-04-func-method-interface.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            1.4 函数、方法和接口

        
        </a>
        

        
    
        
        <a href="ch1-05-mem.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            1.5 面向并发的内存模型

        
        </a>
        

        
    
        
        <a href="ch1-06-goroutine.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            1.6 常见的并发模式

        
        </a>
        

        
    
        
        <a href="ch1-07-error-and-panic.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            1.7 错误和异常

        
        </a>
        

        
    
        
        <a href="ch1-08-ext.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            1.8 补充说明

        
        </a>
        

        
    

        
    
        
        <a href="../ch2-cgo/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第2章 CGO编程

        
        </a>
        

        
    
        
        <a href="../ch3-asm/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第3章 汇编语言

        
        </a>
        

        
    
        
        <a href="../ch4-rpc/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第4章 RPC和Protobuf

        
        </a>
        

        
    
        
        <a href="../ch5-web/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第5章 Go和Web

        
        </a>
        

        
    
        
        <a href="../ch6-cloud/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第6章 分布式系统

        
        </a>
        

        
    
        
        <a href="../appendix/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            附录

        
        </a>
        

        
    

        </div>
    </div>
    



                    </div>
                    <div class="col-md-9">
                        
<div id="book-search-results">
    <div class="search-noresults">
    
                            
                            <div class="gb-markdown book-page-inner">
                                <h1 id="11-go&#x8BED;&#x8A00;&#x521B;&#x4E16;&#x7EAA;">1.1 Go&#x8BED;&#x8A00;&#x521B;&#x4E16;&#x7EAA;</h1>
<p>Go&#x8BED;&#x8A00;&#x6700;&#x521D;&#x7531;Google&#x516C;&#x53F8;&#x7684;Robert Griesemer&#x3001;Ken Thompson&#x548C;Rob Pike&#x4E09;&#x4E2A;&#x5927;&#x725B;&#x4E8E;2007&#x5E74;&#x5F00;&#x59CB;&#x8BBE;&#x8BA1;&#x53D1;&#x660E;&#xFF0C;&#x8BBE;&#x8BA1;&#x65B0;&#x8BED;&#x8A00;&#x7684;&#x6700;&#x521D;&#x7684;&#x6D2A;&#x8352;&#x4E4B;&#x529B;&#x6765;&#x81EA;&#x4E8E;&#x5BF9;&#x8D85;&#x7EA7;&#x590D;&#x6742;&#x7684;C++11&#x7279;&#x6027;&#x7684;&#x5439;&#x6367;&#x62A5;&#x544A;&#x7684;&#x9119;&#x89C6;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x76EE;&#x6807;&#x662F;&#x8BBE;&#x8BA1;&#x7F51;&#x7EDC;&#x548C;&#x591A;&#x6838;&#x65F6;&#x4EE3;&#x7684;C&#x8BED;&#x8A00;&#x3002;&#x5230;2008&#x5E74;&#x4E2D;&#x671F;&#xFF0C;&#x8BED;&#x8A00;&#x7684;&#x5927;&#x90E8;&#x5206;&#x7279;&#x6027;&#x8BBE;&#x8BA1;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#xFF0C;&#x5E76;&#x5F00;&#x59CB;&#x7740;&#x624B;&#x5B9E;&#x73B0;&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5927;&#x7EA6;&#x5728;&#x8FD9;&#x4E00;&#x5E74;Russ Cox&#x4F5C;&#x4E3A;&#x4E3B;&#x529B;&#x5F00;&#x53D1;&#x8005;&#x52A0;&#x5165;&#x3002;&#x5230;&#x4E86;2010&#x5E74;&#xFF0C;Go&#x8BED;&#x8A00;&#x5DF2;&#x7ECF;&#x9010;&#x6B65;&#x8D8B;&#x4E8E;&#x7A33;&#x5B9A;&#x3002;&#x540C;&#x5E74;9&#x6708;&#xFF0C;Go&#x8BED;&#x8A00;&#x6B63;&#x5F0F;&#x53D1;&#x5E03;&#x5E76;&#x5F00;&#x6E90;&#x4E86;&#x4EE3;&#x7801;&#x3002;</p>
<p>Go&#x8BED;&#x8A00;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x88AB;&#x63CF;&#x8FF0;&#x4E3A;&#x201C;&#x7C7B;C&#x8BED;&#x8A00;&#x201D;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x201C;21&#x4E16;&#x7EAA;&#x7684;C&#x8BED;&#x8A00;&#x201D;&#x3002;&#x4ECE;&#x5404;&#x79CD;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;Go&#x8BED;&#x8A00;&#x786E;&#x5B9E;&#x662F;&#x4ECE;C&#x8BED;&#x8A00;&#x7EE7;&#x627F;&#x4E86;&#x76F8;&#x4F3C;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x8BED;&#x6CD5;&#x3001;&#x63A7;&#x5236;&#x6D41;&#x7ED3;&#x6784;&#x3001;&#x57FA;&#x7840;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3001;&#x8C03;&#x7528;&#x53C2;&#x6570;&#x4F20;&#x503C;&#x3001;&#x6307;&#x9488;&#x7B49;&#x8BF8;&#x591A;&#x7F16;&#x7A0B;&#x601D;&#x60F3;&#xFF0C;&#x8FD8;&#x6709;&#x5F7B;&#x5E95;&#x7EE7;&#x627F;&#x548C;&#x53D1;&#x626C;&#x4E86;C&#x8BED;&#x8A00;&#x7B80;&#x5355;&#x76F4;&#x63A5;&#x7684;&#x66B4;&#x529B;&#x7F16;&#x7A0B;&#x54F2;&#x5B66;&#x7B49;&#x3002;&#x56FE;1-1&#x662F;&#x300A;Go&#x8BED;&#x8A00;&#x5723;&#x7ECF;&#x300B;&#x4E2D;&#x7ED9;&#x51FA;&#x7684;Go&#x8BED;&#x8A00;&#x7684;&#x57FA;&#x56E0;&#x56FE;&#x8C31;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x4E2D;&#x770B;&#x5230;&#x6709;&#x54EA;&#x4E9B;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5BF9;Go&#x8BED;&#x8A00;&#x4EA7;&#x751F;&#x4E86;&#x5F71;&#x54CD;&#x3002;</p>
<p><img src="../images/ch1-1-go-family-tree.png" alt=""></p>
<p><em>&#x56FE; 1-1 Go&#x8BED;&#x8A00;&#x57FA;&#x56E0;&#x65CF;&#x8C31;</em></p>
<p>&#x9996;&#x5148;&#x770B;&#x57FA;&#x56E0;&#x56FE;&#x8C31;&#x7684;&#x5DE6;&#x8FB9;&#x4E00;&#x652F;&#x3002;&#x53EF;&#x4EE5;&#x660E;&#x786E;&#x770B;&#x51FA;Go&#x8BED;&#x8A00;&#x7684;&#x5E76;&#x53D1;&#x7279;&#x6027;&#x662F;&#x7531;&#x8D1D;&#x5C14;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;Hoare&#x4E8E;1978&#x5E74;&#x53D1;&#x5E03;&#x7684;CSP&#x7406;&#x8BBA;&#x6F14;&#x5316;&#x800C;&#x6765;&#x3002;&#x5176;&#x540E;&#xFF0C;CSP&#x5E76;&#x53D1;&#x6A21;&#x578B;&#x5728;Squeak/NewSqueak&#x548C;Alef&#x7B49;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x9010;&#x6B65;&#x5B8C;&#x5584;&#x5E76;&#x8D70;&#x5411;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#xFF0C;&#x6700;&#x7EC8;&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#x7ECF;&#x9A8C;&#x88AB;&#x6D88;&#x5316;&#x5E76;&#x5438;&#x6536;&#x5230;&#x4E86;Go&#x8BED;&#x8A00;&#x4E2D;&#x3002;&#x4E1A;&#x754C;&#x6BD4;&#x8F83;&#x719F;&#x6089;&#x7684;Erlang&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x4E5F;&#x662F;CSP&#x7406;&#x8BBA;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x518D;&#x770B;&#x57FA;&#x56E0;&#x56FE;&#x8C31;&#x7684;&#x4E2D;&#x95F4;&#x4E00;&#x652F;&#x3002;&#x4E2D;&#x95F4;&#x4E00;&#x652F;&#x4E3B;&#x8981;&#x5305;&#x542B;&#x4E86;Go&#x8BED;&#x8A00;&#x4E2D;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x548C;&#x5305;&#x7279;&#x6027;&#x7684;&#x6F14;&#x5316;&#x5386;&#x7A0B;&#x3002;Go&#x8BED;&#x8A00;&#x4E2D;&#x5305;&#x548C;&#x63A5;&#x53E3;&#x4EE5;&#x53CA;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7B49;&#x7279;&#x6027;&#x5219;&#x7EE7;&#x627F;&#x81EA;Niklaus Wirth&#x6240;&#x8BBE;&#x8BA1;&#x7684;Pascal&#x8BED;&#x8A00;&#x4EE5;&#x53CA;&#x5176;&#x540E;&#x6240;&#x884D;&#x751F;&#x7684;&#x76F8;&#x5173;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x5176;&#x4E2D;&#x5305;&#x7684;&#x6982;&#x5FF5;&#x3001;&#x5305;&#x7684;&#x5BFC;&#x5165;&#x548C;&#x58F0;&#x660E;&#x7B49;&#x8BED;&#x6CD5;&#x4E3B;&#x8981;&#x6765;&#x81EA;&#x4E8E;Modula-2&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7279;&#x6027;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x65B9;&#x6CD5;&#x7684;&#x58F0;&#x660E;&#x8BED;&#x6CD5;&#x7B49;&#x5219;&#x6765;&#x81EA;&#x4E8E;Oberon&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x6700;&#x7EC8;Go&#x8BED;&#x8A00;&#x6F14;&#x5316;&#x51FA;&#x4E86;&#x81EA;&#x5DF1;&#x7279;&#x6709;&#x7684;&#x652F;&#x6301;&#x9E2D;&#x5B50;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x7684;&#x9690;&#x5F0F;&#x63A5;&#x53E3;&#x7B49;&#x8BF8;&#x591A;&#x7279;&#x6027;&#x3002;</p>
<p>&#x6700;&#x540E;&#x662F;&#x57FA;&#x56E0;&#x56FE;&#x8C31;&#x7684;&#x53F3;&#x8FB9;&#x4E00;&#x652F;&#xFF0C;&#x8FD9;&#x662F;&#x5BF9;C&#x8BED;&#x8A00;&#x7684;&#x81F4;&#x656C;&#x3002;Go&#x8BED;&#x8A00;&#x662F;&#x5BF9;C&#x8BED;&#x8A00;&#x6700;&#x5F7B;&#x5E95;&#x7684;&#x4E00;&#x6B21;&#x626C;&#x5F03;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8BED;&#x6CD5;&#x548C;C&#x8BED;&#x8A00;&#x6709;&#x7740;&#x5F88;&#x591A;&#x5DEE;&#x5F02;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x820D;&#x5F03;&#x4E86;C&#x8BED;&#x8A00;&#x4E2D;&#x7075;&#x6D3B;&#x4F46;&#x662F;&#x5371;&#x9669;&#x7684;&#x6307;&#x9488;&#x8FD0;&#x7B97;&#x3002;&#x800C;&#x4E14;&#xFF0C;Go&#x8BED;&#x8A00;&#x8FD8;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x4E86;C&#x8BED;&#x8A00;&#x4E2D;&#x90E8;&#x5206;&#x4E0D;&#x592A;&#x5408;&#x7406;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x5E76;&#x5728;&#x5F88;&#x591A;&#x7EC6;&#x5FAE;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x505A;&#x4E86;&#x5FC5;&#x8981;&#x7684;&#x6253;&#x78E8;&#x548C;&#x6539;&#x53D8;&#x3002;&#x5F53;&#x7136;&#xFF0C;C&#x8BED;&#x8A00;&#x4E2D;&#x5C11;&#x5373;&#x662F;&#x591A;&#x3001;&#x7B80;&#x5355;&#x76F4;&#x63A5;&#x7684;&#x66B4;&#x529B;&#x7F16;&#x7A0B;&#x54F2;&#x5B66;&#x5219;&#x88AB;Go&#x8BED;&#x8A00;&#x66F4;&#x5F7B;&#x5E95;&#x5730;&#x53D1;&#x626C;&#x5149;&#x5927;&#x4E86;&#xFF08;Go&#x8BED;&#x8A00;&#x5C45;&#x7136;&#x53EA;&#x6709;25&#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF0C;sepc&#x8BED;&#x8A00;&#x89C4;&#x8303;&#x8FD8;&#x4E0D;&#x5230;50&#x9875;)&#xFF09;&#x3002;</p>
<p>Go&#x8BED;&#x8A00;&#x5176;&#x5B83;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x6027;&#x96F6;&#x6563;&#x5730;&#x6765;&#x81EA;&#x4E8E;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF1B;&#x6BD4;&#x5982;iota&#x8BED;&#x6CD5;&#x662F;&#x4ECE;APL&#x8BED;&#x8A00;&#x501F;&#x9274;&#xFF0C;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x4E0E;&#x5D4C;&#x5957;&#x51FD;&#x6570;&#x7B49;&#x7279;&#x6027;&#x6765;&#x81EA;&#x4E8E;Scheme&#x8BED;&#x8A00;&#xFF08;&#x548C;&#x5176;&#x4ED6;&#x5F88;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF09;&#x3002;Go&#x8BED;&#x8A00;&#x4E2D;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x81EA;&#x5DF1;&#x53D1;&#x660E;&#x521B;&#x65B0;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x6BD4;&#x5982;Go&#x8BED;&#x8A00;&#x7684;&#x5207;&#x7247;&#x4E3A;&#x8F7B;&#x91CF;&#x7EA7;&#x52A8;&#x6001;&#x6570;&#x7EC4;&#x63D0;&#x4F9B;&#x4E86;&#x6709;&#x6548;&#x7684;&#x968F;&#x673A;&#x5B58;&#x53D6;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4EBA;&#x8054;&#x60F3;&#x5230;&#x94FE;&#x8868;&#x7684;&#x5E95;&#x5C42;&#x7684;&#x5171;&#x4EAB;&#x673A;&#x5236;&#x3002;&#x8FD8;&#x6709;Go&#x8BED;&#x8A00;&#x65B0;&#x53D1;&#x660E;&#x7684;defer&#x8BED;&#x53E5;&#xFF08;Ken&#x53D1;&#x660E;&#xFF09;&#x4E5F;&#x662F;&#x795E;&#x6765;&#x4E4B;&#x7B14;&#x3002;</p>
<h2 id="111-&#x6765;&#x81EA;&#x8D1D;&#x5C14;&#x5B9E;&#x9A8C;&#x5BA4;&#x7279;&#x6709;&#x57FA;&#x56E0;">1.1.1 &#x6765;&#x81EA;&#x8D1D;&#x5C14;&#x5B9E;&#x9A8C;&#x5BA4;&#x7279;&#x6709;&#x57FA;&#x56E0;</h2>
<p>&#x4F5C;&#x4E3A;Go&#x8BED;&#x8A00;&#x6807;&#x5FD7;&#x6027;&#x7684;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x7279;&#x6027;&#x5219;&#x6765;&#x81EA;&#x4E8E;&#x8D1D;&#x5C14;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;Tony Hoare&#x4E8E;1978&#x5E74;&#x53D1;&#x8868;&#x7684;&#x9C9C;&#x4E3A;&#x5916;&#x754C;&#x6240;&#x77E5;&#x7684;&#x5173;&#x4E8E;&#x5E76;&#x53D1;&#x7814;&#x7A76;&#x7684;&#x57FA;&#x7840;&#x6587;&#x732E;&#xFF1A;&#x987A;&#x5E8F;&#x901A;&#x4FE1;&#x8FDB;&#x7A0B;&#xFF08;communicating sequential processes &#xFF0C;&#x7F29;&#x5199;&#x4E3A;CSP&#xFF09;&#x3002;&#x5728;&#x6700;&#x521D;&#x7684;CSP&#x8BBA;&#x6587;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x53EA;&#x662F;&#x4E00;&#x7EC4;&#x6CA1;&#x6709;&#x4E2D;&#x95F4;&#x5171;&#x4EAB;&#x72B6;&#x6001;&#x7684;&#x5E73;&#x884C;&#x8FD0;&#x884C;&#x7684;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x4F7F;&#x7528;&#x7BA1;&#x9053;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x548C;&#x63A7;&#x5236;&#x540C;&#x6B65;&#x3002;Tony Hoare&#x7684;CSP&#x5E76;&#x53D1;&#x6A21;&#x578B;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x5E76;&#x53D1;&#x6027;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x7684;&#x63CF;&#x8FF0;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x7684;&#x901A;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;</p>
<p>CSP&#x5E76;&#x53D1;&#x6A21;&#x578B;&#x6700;&#x7ECF;&#x5178;&#x7684;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x662F;&#x6765;&#x81EA;&#x7231;&#x7ACB;&#x4FE1;&#x53D1;&#x660E;&#x7684;Erlang&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x4E0D;&#x8FC7;&#x5728;Erlang&#x5C06;CSP&#x7406;&#x8BBA;&#x4F5C;&#x4E3A;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x540C;&#x6837;&#x6765;&#x81EA;&#x8D1D;&#x5C14;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;Rob Pike&#x4EE5;&#x53CA;&#x5176;&#x540C;&#x4E8B;&#x4E5F;&#x5728;&#x4E0D;&#x65AD;&#x5C1D;&#x8BD5;&#x5C06;CSP&#x5E76;&#x53D1;&#x6A21;&#x578B;&#x5F15;&#x5165;&#x5F53;&#x65F6;&#x7684;&#x65B0;&#x53D1;&#x660E;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x3002;&#x4ED6;&#x4EEC;&#x7B2C;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;&#x5F15;&#x5165;CSP&#x5E76;&#x53D1;&#x7279;&#x6027;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x53EB;Squeak&#xFF08;&#x8001;&#x9F20;&#x7684;&#x53EB;&#x58F0;&#xFF09;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x63D0;&#x4F9B;&#x9F20;&#x6807;&#x548C;&#x952E;&#x76D8;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8BED;&#x8A00;&#x4E2D;&#x7BA1;&#x9053;&#x662F;&#x9759;&#x6001;&#x521B;&#x5EFA;&#x7684;&#x3002;&#x7136;&#x540E;&#x662F;&#x6539;&#x8FDB;&#x7248;&#x7684;Newsqueak&#x8BED;&#x8A00;&#xFF08;&#x65B0;&#x7248;&#x8001;&#x9F20;&#x7684;&#x53EB;&#x58F0;&#xFF09;&#xFF0C;&#x65B0;&#x63D0;&#x4F9B;&#x4E86;&#x7C7B;&#x4F3C;C&#x8BED;&#x8A00;&#x8BED;&#x53E5;&#x548C;&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x8FD8;&#x6709;&#x7C7B;&#x4F3C;Pascal&#x8BED;&#x8A00;&#x7684;&#x63A8;&#x5BFC;&#x8BED;&#x6CD5;&#x3002;Newsqueak&#x662F;&#x4E00;&#x4E2A;&#x5E26;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x7EAF;&#x51FD;&#x6570;&#x5F0F;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x518D;&#x6B21;&#x9488;&#x5BF9;&#x952E;&#x76D8;&#x3001;&#x9F20;&#x6807;&#x548C;&#x7A97;&#x53E3;&#x4E8B;&#x4EF6;&#x7BA1;&#x7406;&#x3002;&#x4F46;&#x662F;&#x5728;Newsqueak&#x8BED;&#x8A00;&#x4E2D;&#x7BA1;&#x9053;&#x5DF2;&#x7ECF;&#x662F;&#x52A8;&#x6001;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x7BA1;&#x9053;&#x5C5E;&#x4E8E;&#x7B2C;&#x4E00;&#x7C7B;&#x503C;&#x3001;&#x53EF;&#x4EE5;&#x4FDD;&#x5B58;&#x5230;&#x53D8;&#x91CF;&#x4E2D;&#x3002;&#x7136;&#x540E;&#x662F;Alef&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF08;Alef&#x4E5F;&#x662F;C&#x8BED;&#x8A00;&#x4E4B;&#x7236;Ritchie&#x6BD4;&#x8F83;&#x559C;&#x7231;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF09;&#xFF0C;Alef&#x8BED;&#x8A00;&#x8BD5;&#x56FE;&#x5C06;Newsqueak&#x8BED;&#x8A00;&#x6539;&#x9020;&#x4E3A;&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x4F46;&#x662F;&#x56E0;&#x4E3A;&#x7F3A;&#x5C11;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x800C;&#x5BFC;&#x81F4;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x5F88;&#x75DB;&#x82E6;&#xFF08;&#x8FD9;&#x4E5F;&#x662F;&#x7EE7;&#x627F;C&#x8BED;&#x8A00;&#x624B;&#x5DE5;&#x7BA1;&#x7406;&#x5185;&#x5B58;&#x7684;&#x4EE3;&#x4EF7;&#xFF09;&#x3002;&#x5728;Aelf&#x8BED;&#x8A00;&#x4E4B;&#x540E;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x53EB;Limbo&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF08;&#x5730;&#x72F1;&#x7684;&#x610F;&#x601D;&#xFF09;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x7684;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x3002;Limbo&#x8BED;&#x8A00;&#x662F;Go&#x8BED;&#x8A00;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x7956;&#x5148;&#xFF0C;&#x5B83;&#x548C;Go&#x8BED;&#x8A00;&#x6709;&#x7740;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x8BED;&#x6CD5;&#x3002;&#x5230;&#x8BBE;&#x8BA1;Go&#x8BED;&#x8A00;&#x65F6;&#xFF0C;Rob Pike&#x5728;CSP&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x7684;&#x5B9E;&#x8DF5;&#x9053;&#x8DEF;&#x4E0A;&#x5DF2;&#x7ECF;&#x79EF;&#x7D2F;&#x4E86;&#x51E0;&#x5341;&#x5E74;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x5173;&#x4E8E;Go&#x8BED;&#x8A00;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x7684;&#x7279;&#x6027;&#x5B8C;&#x5168;&#x662F;&#x4FE1;&#x624B;&#x62C8;&#x6765;&#xFF0C;&#x65B0;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x5230;&#x6765;&#x4E5F;&#x662F;&#x6C34;&#x5230;&#x6E20;&#x6210;&#x4E86;&#x3002;</p>
<p>&#x56FE;1-2&#x5C55;&#x793A;&#x4E86;Go&#x8BED;&#x8A00;&#x5E93;&#x65E9;&#x671F;&#x4EE3;&#x7801;&#x5E93;&#x65E5;&#x5FD7;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6700;&#x76F4;&#x63A5;&#x7684;&#x6F14;&#x5316;&#x5386;&#x7A0B;&#xFF08;Git&#x7528;<code>git log --before={2008-03-03} --reverse</code>&#x547D;&#x4EE4;&#x67E5;&#x770B;&#xFF09;&#x3002;</p>
<p><img src="../images/ch1-2-go-log4.png" alt=""></p>
<p><em>&#x56FE; 1-2 Go&#x8BED;&#x8A00;&#x5F00;&#x53D1;&#x65E5;&#x5FD7;</em></p>
<p>&#x4ECE;&#x65E9;&#x671F;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;&#x4E2D;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;Go&#x8BED;&#x8A00;&#x662F;&#x4ECE;Ken Thompson&#x53D1;&#x660E;&#x7684;B&#x8BED;&#x8A00;&#x3001;Dennis M. Ritchie&#x53D1;&#x660E;&#x7684;C&#x8BED;&#x8A00;&#x9010;&#x6B65;&#x6F14;&#x5316;&#x8FC7;&#x6765;&#x7684;&#xFF0C;&#x5B83;&#x9996;&#x5148;&#x662F;C&#x8BED;&#x8A00;&#x5BB6;&#x65CF;&#x7684;&#x6210;&#x5458;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x591A;&#x4EBA;&#x5C06;Go&#x8BED;&#x8A00;&#x79F0;&#x4E3A;21&#x4E16;&#x7EAA;&#x7684;C&#x8BED;&#x8A00;&#x3002;</p>
<p>&#x56FE;1-3&#x662F;Go&#x8BED;&#x8A00;&#x4E2D;&#x6765;&#x81EA;&#x8D1D;&#x5C14;&#x5B9E;&#x9A8C;&#x5BA4;&#x7279;&#x6709;&#x5E76;&#x53D1;&#x7F16;&#x7A0B;&#x57FA;&#x56E0;&#x7684;&#x6F14;&#x5316;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p><img src="../images/ch1-3-go-history.png" alt=""></p>
<p><em>&#x56FE; 1-3 Go&#x8BED;&#x8A00;&#x5E76;&#x53D1;&#x6F14;&#x5316;&#x5386;&#x53F2;</em></p>
<p>&#x7EB5;&#x89C2;&#x6574;&#x4E2A;&#x8D1D;&#x5C14;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x53D1;&#x5C55;&#x8FDB;&#x7A0B;&#xFF0C;&#x4ECE;B&#x8BED;&#x8A00;&#x3001;C&#x8BED;&#x8A00;&#x3001;Newsqueak&#x3001;Alef&#x3001;Limbo&#x8BED;&#x8A00;&#x4E00;&#x8DEF;&#x8D70;&#x6765;&#xFF0C;Go&#x8BED;&#x8A00;&#x7EE7;&#x627F;&#x4E86;&#x6765;&#x7740;&#x8D1D;&#x5C14;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x534A;&#x4E2A;&#x4E16;&#x7EAA;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x57FA;&#x56E0;&#xFF0C;&#x7EC8;&#x4E8E;&#x5B8C;&#x6210;&#x4E86;C&#x8BED;&#x8A00;&#x9769;&#x65B0;&#x7684;&#x4F7F;&#x547D;&#x3002;&#x7EB5;&#x89C2;&#x8FD9;&#x51E0;&#x5E74;&#x6765;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#xFF0C;Go&#x8BED;&#x8A00;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4E91;&#x8BA1;&#x7B97;&#x3001;&#x4E91;&#x5B58;&#x50A8;&#x65F6;&#x4EE3;&#x6700;&#x91CD;&#x8981;&#x7684;&#x57FA;&#x7840;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;</p>
<h2 id="112-&#x4F60;&#x597D;-&#x4E16;&#x754C;">1.1.2 &#x4F60;&#x597D;, &#x4E16;&#x754C;</h2>
<p>&#x6309;&#x7167;&#x60EF;&#x4F8B;&#xFF0C;&#x4ECB;&#x7ECD;&#x6240;&#x6709;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x201C;Hello, World!&#x201D;&#x3002;&#x867D;&#x7136;&#x672C;&#x6559;&#x5047;&#x8BBE;&#x8BFB;&#x8005;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x4E86;Go&#x8BED;&#x8A00;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x4E0D;&#x60F3;&#x6253;&#x7834;&#x8FD9;&#x4E2A;&#x60EF;&#x4F8B;&#xFF08;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x4F20;&#x7EDF;&#x6B63;&#x662F;&#x4ECE;Go&#x8BED;&#x8A00;&#x7684;&#x524D;&#x8F88;C&#x8BED;&#x8A00;&#x4F20;&#x627F;&#x800C;&#x6765;&#x7684;&#xFF09;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5C55;&#x793A;&#x7684;Go&#x8BED;&#x8A00;&#x7A0B;&#x5E8F;&#x8F93;&#x51FA;&#x7684;&#x662F;&#x4E2D;&#x6587;&#x201C;&#x4F60;&#x597D;, &#x4E16;&#x754C;!&#x201D;&#x3002;</p>
<pre><code class="lang-Go"><span class="hljs-keyword">package</span> main

<span class="hljs-keyword">import</span> <span class="hljs-string">&quot;fmt&quot;</span>

<span class="hljs-keyword">func</span> main() {
    fmt.Println(<span class="hljs-string">&quot;&#x4F60;&#x597D;, &#x4E16;&#x754C;!&quot;</span>)
}
</code></pre>
<p>&#x5C06;&#x4EE5;&#x4E0A;&#x4EE3;&#x7801;&#x4FDD;&#x5B58;&#x5230;<code>hello.go</code>&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x56E0;&#x4E3A;&#x4EE3;&#x7801;&#x4E2D;&#x6709;&#x975E;ASCII&#x7684;&#x4E2D;&#x6587;&#x5B57;&#x7B26;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x6587;&#x4EF6;&#x7684;&#x7F16;&#x7801;&#x663E;&#x5F0F;&#x6307;&#x5B9A;&#x4E3A;&#x65E0;BOM&#x7684;UTF8&#x7F16;&#x7801;&#x683C;&#x5F0F;&#xFF08;&#x6E90;&#x6587;&#x4EF6;&#x91C7;&#x7528;UTF8&#x7F16;&#x7801;&#x662F;Go&#x8BED;&#x8A00;&#x89C4;&#x8303;&#x6240;&#x8981;&#x6C42;&#x7684;&#xFF09;&#x3002;&#x7136;&#x540E;&#x8FDB;&#x5165;&#x547D;&#x4EE4;&#x884C;&#x5E76;&#x5207;&#x6362;&#x5230;<code>hello.go</code>&#x6587;&#x4EF6;&#x6240;&#x5728;&#x7684;&#x76EE;&#x5F55;&#x3002;&#x76EE;&#x524D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;Go&#x8BED;&#x8A00;&#x5F53;&#x4F5C;&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF0C;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E2D;&#x76F4;&#x63A5;&#x8F93;&#x5165;<code>go run hello.go</code>&#x6765;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x3002;&#x5982;&#x679C;&#x4E00;&#x5207;&#x6B63;&#x5E38;&#x7684;&#x8BDD;&#x3002;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x770B;&#x5230;&#x8F93;&#x51FA;&quot;&#x4F60;&#x597D;, &#x4E16;&#x754C;!&quot;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7B80;&#x5355;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x7A0B;&#x5E8F;&#x3002;&#x6240;&#x6709;&#x7684;Go&#x7A0B;&#x5E8F;&#xFF0C;&#x90FD;&#x662F;&#x7531;&#x6700;&#x57FA;&#x672C;&#x7684;&#x51FD;&#x6570;&#x548C;&#x53D8;&#x91CF;&#x6784;&#x6210;&#xFF0C;&#x51FD;&#x6570;&#x548C;&#x53D8;&#x91CF;&#x88AB;&#x7EC4;&#x7EC7;&#x5230;&#x4E00;&#x4E2A;&#x4E2A;&#x5355;&#x72EC;&#x7684;Go&#x6E90;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x6E90;&#x6587;&#x4EF6;&#x518D;&#x6309;&#x7167;&#x4F5C;&#x8005;&#x7684;&#x610F;&#x56FE;&#x7EC4;&#x7EC7;&#x6210;&#x5408;&#x9002;&#x7684;package&#xFF0C;&#x6700;&#x7EC8;&#x8FD9;&#x4E9B;package&#x518D;&#x6709;&#x673A;&#x5730;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;Go&#x8BED;&#x8A00;&#x7A0B;&#x5E8F;&#x3002;&#x5176;&#x4E2D;&#xFF0C;&#x51FD;&#x6570;&#x7528;&#x4E8E;&#x5305;&#x542B;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x8BED;&#x53E5;(&#x6307;&#x660E;&#x8981;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x5E8F;&#x5217;)&#xFF0C;&#x4EE5;&#x53CA;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x65F6;&#x5B58;&#x653E;&#x6570;&#x636E;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E2D;&#x51FD;&#x6570;&#x7684;&#x540D;&#x5B57;&#x662F;main&#x3002;&#x867D;&#x7136;Go&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x51FD;&#x6570;&#x7684;&#x540D;&#x5B57;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x4F46;&#x662F;main&#x5305;&#x4E2D;&#x7684;main&#x51FD;&#x6570;&#x9ED8;&#x8BA4;&#x662F;&#x6BCF;&#x4E00;&#x4E2A;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x7684;&#x5165;&#x53E3;&#x3002;&#x800C;package&#x5219;&#x7528;&#x4E8E;&#x5305;&#x88C5;&#x548C;&#x7EC4;&#x7EC7;&#x76F8;&#x5173;&#x7684;&#x51FD;&#x6570;&#x3001;&#x53D8;&#x91CF;&#x548C;&#x5E38;&#x91CF;&#x3002;&#x5728;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;package&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4F7F;&#x7528;import&#x8BED;&#x53E5;&#x5BFC;&#x5165;&#x5305;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E2D;&#x5BFC;&#x5165;&#x4E86;fmt&#x5305;&#xFF08;fmt&#x662F;format&#x5355;&#x8BCD;&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x8868;&#x793A;&#x683C;&#x5F0F;&#x5316;&#x76F8;&#x5173;&#x7684;&#x5305;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x624D;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;fmt&#x5305;&#x4E2D;&#x7684;Println&#x51FD;&#x6570;&#x3002;</p>
<p>&#x800C;&#x53CC;&#x5F15;&#x53F7;&#x5305;&#x542B;&#x7684;&#x201C;&#x4F60;&#x597D;, &#x4E16;&#x754C;!&#x201D;&#x5219;&#x662F;Go&#x8BED;&#x8A00;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x9762;&#x503C;&#x5E38;&#x91CF;&#x3002;&#x548C;C&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4E0D;&#x540C;&#xFF0C;Go&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5185;&#x5BB9;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x66F4;&#x7684;&#x3002;&#x5728;&#x4EE5;&#x5B57;&#x7B26;&#x4E32;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x7ED9;fmt.Println&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5185;&#x5BB9;&#x5E76;&#x6CA1;&#x6709;&#x88AB;&#x590D;&#x5236;&#x2014;&#x2014;&#x4F20;&#x9012;&#x7684;&#x4EC5;&#x4EC5;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5730;&#x5740;&#x548C;&#x957F;&#x5EA6;&#xFF08;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x7ED3;&#x6784;&#x5728;<code>reflect.StringHeader</code>&#x4E2D;&#x5B9A;&#x4E49;&#xFF09;&#x3002;&#x5728;Go&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x90FD;&#x662F;&#x4EE5;&#x590D;&#x5236;&#x7684;&#x65B9;&#x5F0F;(&#x4E0D;&#x652F;&#x6301;&#x4EE5;&#x5F15;&#x7528;&#x7684;&#x65B9;&#x5F0F;)&#x4F20;&#x9012;&#xFF08;&#x6BD4;&#x8F83;&#x7279;&#x6B8A;&#x7684;&#x662F;&#xFF0C;Go&#x8BED;&#x8A00;&#x95ED;&#x5305;&#x51FD;&#x6570;&#x5BF9;&#x5916;&#x90E8;&#x53D8;&#x91CF;&#x662F;&#x4EE5;&#x5F15;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#xFF09;&#x3002;</p>

                            </div>
                            
                        
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                    </div>
                </div>
            </div>
        </div>
    </div>
</div>

<script src="../gitbook/gitbook.js"></script>

    
    <script src="../gitbook/gitbook-plugin-bg-nest/bg-nest.min.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-bg-nest/init.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
    

<script>
(function() {
    gitbook.page.hasChanged({"page":{"title":"1.1 Go语言创世纪","level":"1.2.1","depth":2,"next":{"title":"1.2 Hello, World 的革命","level":"1.2.2","depth":2,"path":"ch1-basic/ch1-02-hello-revolution.md","ref":"ch1-basic/ch1-02-hello-revolution.md","articles":[]},"previous":{"title":"第1章 语言基础","level":"1.2","depth":1,"path":"ch1-basic/readme.md","ref":"ch1-basic/readme.md","articles":[{"title":"1.1 Go语言创世纪","level":"1.2.1","depth":2,"path":"ch1-basic/ch1-01-genesis.md","ref":"ch1-basic/ch1-01-genesis.md","articles":[]},{"title":"1.2 Hello, World 的革命","level":"1.2.2","depth":2,"path":"ch1-basic/ch1-02-hello-revolution.md","ref":"ch1-basic/ch1-02-hello-revolution.md","articles":[]},{"title":"1.3 数组、字符串和切片","level":"1.2.3","depth":2,"path":"ch1-basic/ch1-03-array-string-and-slice.md","ref":"ch1-basic/ch1-03-array-string-and-slice.md","articles":[]},{"title":"1.4 函数、方法和接口","level":"1.2.4","depth":2,"path":"ch1-basic/ch1-04-func-method-interface.md","ref":"ch1-basic/ch1-04-func-method-interface.md","articles":[]},{"title":"1.5 面向并发的内存模型","level":"1.2.5","depth":2,"path":"ch1-basic/ch1-05-mem.md","ref":"ch1-basic/ch1-05-mem.md","articles":[]},{"title":"1.6 常见的并发模式","level":"1.2.6","depth":2,"path":"ch1-basic/ch1-06-goroutine.md","ref":"ch1-basic/ch1-06-goroutine.md","articles":[]},{"title":"1.7 错误和异常","level":"1.2.7","depth":2,"path":"ch1-basic/ch1-07-error-and-panic.md","ref":"ch1-basic/ch1-07-error-and-panic.md","articles":[]},{"title":"1.8 补充说明","level":"1.2.8","depth":2,"path":"ch1-basic/ch1-08-ext.md","ref":"ch1-basic/ch1-08-ext.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["theme-opendocs","bg-nest","-lunr","-search","search-pro","-sharing","-fontsettings"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"bg-nest":{},"search-pro":{},"highlight":{},"theme-opendocs":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"preface.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Go语言高级编程","language":"zh-hans","gitbook":"3.x","description":"Go语言高级编程"},"file":{"path":"ch1-basic/ch1-01-genesis.md","mtime":"2019-03-26T06:39:21.131Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-03-26T06:40:10.668Z"},"basePath":"..","book":{"language":""}});
})();
</script>

        
    </body>
</html>

