
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>3.3 常量和全局变量 · Go语言高级编程</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">


    
    <link rel="next" href="ch3-04-func.html" />
    
    
    <link rel="prev" href="ch3-02-arch.html" />
    

    </head>
    <body>
        
<div class="gb-page-wrapper">
    <header class="gb-page-header">
        <div class="container">
        
            <a href=".." class="logo">
                <img src="../gitbook/images/logo/64.png">
                <h1>Go语言高级编程</h1>
            </a>

            

            <div class="page_search_block">
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                
                <a href="ch3-04-func.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-right"></i>
                </a>
                
                
                <a href="ch3-02-arch.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-left"></i>
                </a>
                
            
            </div>
        
        </div>
    </header>

    <div class="gb-page-body">
        <div class="gb-page-inner">
            <div class="container">
                <div class="row">
                    <div class="col-md-3">
                        



    
    <div class="panel panel-default ">
        

        <div class="list-group">
            
    
        
        <a href="../" class="list-group-item ">
        

            

            

            Introduction

        
        </a>
        

        
    
        
        <a href="../ch1-basic/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第1章 语言基础

        
        </a>
        

        
    
        
        <a href="../ch2-cgo/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第2章 CGO编程

        
        </a>
        

        
    
        
        <a href="readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-down"></i>
            

            第3章 汇编语言

        
        </a>
        

        
        
    
        
        <a href="ch3-01-basic.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            3.1 快速入门

        
        </a>
        

        
    
        
        <a href="ch3-02-arch.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            3.2 计算机结构

        
        </a>
        

        
    
        
        <a href="ch3-03-const-and-var.html" class="list-group-item active">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            3.3 常量和全局变量

        
        </a>
        

        
    
        
        <a href="ch3-04-func.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            3.4 函数

        
        </a>
        

        
    
        
        <a href="ch3-05-control-flow.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            3.5 控制流

        
        </a>
        

        
    
        
        <a href="ch3-06-func-again.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            3.6 再论函数

        
        </a>
        

        
    
        
        <a href="ch3-07-hack-asm.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            3.7 汇编语言的威力

        
        </a>
        

        
    
        
        <a href="ch3-08-goroutine-id.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            3.8 例子：Goroutine ID

        
        </a>
        

        
    
        
        <a href="ch3-09-debug.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            3.9 Delve调试器

        
        </a>
        

        
    
        
        <a href="ch3-10-ext.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            3.10 补充说明

        
        </a>
        

        
    

        
    
        
        <a href="../ch4-rpc/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第4章 RPC和Protobuf

        
        </a>
        

        
    
        
        <a href="../ch5-web/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第5章 Go和Web

        
        </a>
        

        
    
        
        <a href="../ch6-cloud/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第6章 分布式系统

        
        </a>
        

        
    
        
        <a href="../appendix/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            附录

        
        </a>
        

        
    

        </div>
    </div>
    



                    </div>
                    <div class="col-md-9">
                        
<div id="book-search-results">
    <div class="search-noresults">
    
                            
                            <div class="gb-markdown book-page-inner">
                                <h1 id="33-&#x5E38;&#x91CF;&#x548C;&#x5168;&#x5C40;&#x53D8;&#x91CF;">3.3 &#x5E38;&#x91CF;&#x548C;&#x5168;&#x5C40;&#x53D8;&#x91CF;</h1>
<p>&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4E00;&#x5207;&#x53D8;&#x91CF;&#x7684;&#x521D;&#x59CB;&#x503C;&#x90FD;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x5730;&#x4F9D;&#x8D56;&#x5E38;&#x91CF;&#x6216;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#x751F;&#x6210;&#x3002;&#x5728;Go&#x8BED;&#x8A00;&#x4E2D;&#x5F88;&#x591A;&#x53D8;&#x91CF;&#x662F;&#x9ED8;&#x8BA4;&#x96F6;&#x503C;&#x521D;&#x59CB;&#x5316;&#x7684;&#xFF0C;&#x4F46;&#x662F;Go&#x6C47;&#x7F16;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x6700;&#x597D;&#x8FD8;&#x662F;&#x624B;&#x5DE5;&#x901A;&#x8FC7;&#x5E38;&#x91CF;&#x521D;&#x59CB;&#x5316;&#x3002;&#x6709;&#x4E86;&#x5E38;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x884D;&#x751F;&#x5B9A;&#x4E49;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5E38;&#x91CF;&#x7EC4;&#x6210;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x521D;&#x59CB;&#x5316;&#x5176;&#x5B83;&#x5404;&#x79CD;&#x53D8;&#x91CF;&#x3002;&#x672C;&#x8282;&#x5C06;&#x7B80;&#x5355;&#x8BA8;&#x8BBA;Go&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x4E2D;&#x5E38;&#x91CF;&#x548C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x7528;&#x6CD5;&#x3002;</p>
<h2 id="331-&#x5E38;&#x91CF;">3.3.1 &#x5E38;&#x91CF;</h2>
<p>Go&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x4E2D;&#x5E38;&#x91CF;&#x4EE5;$&#x7F8E;&#x5143;&#x7B26;&#x53F7;&#x4E3A;&#x524D;&#x7F00;&#x3002;&#x5E38;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x6709;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x3001;&#x6D6E;&#x70B9;&#x6570;&#x5E38;&#x91CF;&#x3001;&#x5B57;&#x7B26;&#x5E38;&#x91CF;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x5E38;&#x91CF;&#x7B49;&#x51E0;&#x79CD;&#x7C7B;&#x578B;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x51E0;&#x79CD;&#x7C7B;&#x578B;&#x5E38;&#x91CF;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>$1           // &#x5341;&#x8FDB;&#x5236;
$0xf4f8fcff  // &#x5341;&#x516D;&#x8FDB;&#x5236;
$1.5         // &#x6D6E;&#x70B9;&#x6570;
$&apos;a&apos;         // &#x5B57;&#x7B26;
$&quot;abcd&quot;      // &#x5B57;&#x7B26;&#x4E32;
</code></pre><p>&#x5176;&#x4E2D;&#x6574;&#x6570;&#x7C7B;&#x578B;&#x5E38;&#x91CF;&#x9ED8;&#x8BA4;&#x662F;&#x5341;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#x8868;&#x793A;&#x6574;&#x6570;&#x5E38;&#x91CF;&#x3002;&#x6240;&#x6709;&#x7684;&#x5E38;&#x91CF;&#x6700;&#x7EC8;&#x90FD;&#x5FC5;&#x987B;&#x548C;&#x8981;&#x521D;&#x59CB;&#x5316;&#x7684;&#x53D8;&#x91CF;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x5339;&#x914D;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6570;&#x503C;&#x578B;&#x5E38;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#x6784;&#x6210;&#x65B0;&#x7684;&#x5E38;&#x91CF;&#xFF1A;</p>
<pre><code>$2+2      // &#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;
$3&amp;1&lt;&lt;2   // == $4
$(3&amp;1)&lt;&lt;2 // == $4
</code></pre><p>&#x5176;&#x4E2D;&#x5E38;&#x91CF;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x8FD0;&#x7B97;&#x7B26;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x548C;Go&#x8BED;&#x8A00;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;</p>
<p>Go&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x5E38;&#x91CF;&#x5176;&#x5B9E;&#x4E0D;&#x4EC5;&#x4EC5;&#x53EA;&#x6709;&#x7F16;&#x8BD1;&#x65F6;&#x5E38;&#x91CF;&#xFF0C;&#x8FD8;&#x5305;&#x542B;&#x8FD0;&#x884C;&#x65F6;&#x5E38;&#x91CF;&#x3002;&#x6BD4;&#x5982;&#x5305;&#x4E2D;&#x5168;&#x5C40;&#x7684;&#x53D8;&#x91CF;&#x548C;&#x5168;&#x5C40;&#x51FD;&#x6570;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x5730;&#x5740;&#x4E5F;&#x662F;&#x56FA;&#x5B9A;&#x4E0D;&#x53D8;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x5730;&#x5740;&#x4E0D;&#x4F1A;&#x53D8;&#x91CF;&#x7684;&#x5305;&#x53D8;&#x91CF;&#x548C;&#x51FD;&#x6570;&#x7684;&#x5730;&#x5740;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x6C47;&#x7F16;&#x5E38;&#x91CF;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x672C;&#x7AE0;&#x7B2C;&#x4E00;&#x8282;&#x7528;&#x6C47;&#x7F16;&#x5B9A;&#x4E49;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>GLOBL &#xB7;NameData(SB),$8
DATA  &#xB7;NameData(SB)/8,$&quot;gopher&quot;

GLOBL &#xB7;Name(SB),$16
DATA  &#xB7;Name+0(SB)/8,$&#xB7;NameData(SB)
DATA  &#xB7;Name+8(SB)/8,$6
</code></pre><p>&#x5176;&#x4E2D;<code>$&#xB7;NameData(SB)</code>&#x4E5F;&#x662F;&#x4EE5;$&#x7F8E;&#x5143;&#x7B26;&#x53F7;&#x4E3A;&#x524D;&#x7F00;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x770B;&#x4F5C;&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#xFF0C;&#x5B83;&#x5BF9;&#x5E94;&#x7684;&#x662F;NameData&#x5305;&#x53D8;&#x91CF;&#x7684;&#x5730;&#x5740;&#x3002;&#x5728;&#x6C47;&#x7F16;&#x6307;&#x4EE4;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;LEA&#x6307;&#x4EE4;&#x6765;&#x83B7;&#x53D6;NameData&#x53D8;&#x91CF;&#x7684;&#x5730;&#x5740;&#x3002;</p>
<h2 id="332-&#x5168;&#x5C40;&#x53D8;&#x91CF;">3.3.2 &#x5168;&#x5C40;&#x53D8;&#x91CF;</h2>
<p>&#x5728;Go&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x53D8;&#x91CF;&#x6839;&#x636E;&#x4F5C;&#x7528;&#x57DF;&#x548C;&#x751F;&#x547D;&#x5468;&#x671F;&#x6709;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E4B;&#x5206;&#x3002;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x662F;&#x5305;&#x4E00;&#x7EA7;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x4E00;&#x822C;&#x6709;&#x7740;&#x8F83;&#x4E3A;&#x56FA;&#x5B9A;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x58F0;&#x660E;&#x5468;&#x671F;&#x8DE8;&#x8D8A;&#x6574;&#x4E2A;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x3002;&#x800C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E00;&#x822C;&#x662F;&#x51FD;&#x6570;&#x5185;&#x5B9A;&#x4E49;&#x7684;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x51FD;&#x6570;&#x88AB;&#x6267;&#x884C;&#x7684;&#x65F6;&#x95F4;&#x624D;&#x88AB;&#x5728;&#x6808;&#x4E0A;&#x521B;&#x5EFA;&#xFF0C;&#x5F53;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5B8C;&#x6210;&#x540E;&#x5C06;&#x56DE;&#x6536;&#xFF08;&#x6682;&#x65F6;&#x4E0D;&#x8003;&#x8651;&#x95ED;&#x5305;&#x5BF9;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x6355;&#x83B7;&#x7684;&#x95EE;&#x9898;&#xFF09;&#x3002;</p>
<p>&#x4ECE;Go&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x6709;&#x7740;&#x975E;&#x5E38;&#x5927;&#x7684;&#x5DEE;&#x5F02;&#x3002;&#x5728;Go&#x6C47;&#x7F16;&#x4E2D;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x5168;&#x5C40;&#x51FD;&#x6570;&#x66F4;&#x4E3A;&#x76F8;&#x4F3C;&#xFF0C;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x4EBA;&#x4E3A;&#x5B9A;&#x4E49;&#x7684;&#x7B26;&#x53F7;&#x6765;&#x5F15;&#x7528;&#x5BF9;&#x5E94;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x533A;&#x522B;&#x53EA;&#x662F;&#x5185;&#x5B58;&#x4E2D;&#x5B58;&#x653E;&#x662F;&#x6570;&#x636E;&#x8FD8;&#x662F;&#x8981;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x51AF;&#x8BFA;&#x4F0A;&#x66FC;&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x6307;&#x4EE4;&#x4E5F;&#x662F;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x4E14;&#x6307;&#x4EE4;&#x548C;&#x6570;&#x636E;&#x5B58;&#x653E;&#x5728;&#x7EDF;&#x4E00;&#x7F16;&#x5740;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x56E0;&#x4E3A;&#x6307;&#x4EE4;&#x548C;&#x6570;&#x636E;&#x5E76;&#x6CA1;&#x6709;&#x672C;&#x8D28;&#x7684;&#x5DEE;&#x522B;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x50CF;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x90A3;&#x6837;&#x52A8;&#x6001;&#x751F;&#x6210;&#x6307;&#x4EE4;&#xFF08;&#x8FD9;&#x662F;&#x6240;&#x6709;JIT&#x6280;&#x672F;&#x7684;&#x539F;&#x7406;&#xFF09;&#x3002;&#x800C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5219;&#x9700;&#x5728;&#x4E86;&#x89E3;&#x4E86;&#x6C47;&#x7F16;&#x51FD;&#x6570;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x80FD;&#x901A;&#x8FC7;SP&#x6808;&#x7A7A;&#x95F4;&#x6765;&#x9690;&#x5F0F;&#x5B9A;&#x4E49;&#x3002;</p>
<p>&#x5728;Go&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5185;&#x5B58;&#x662F;&#x901A;&#x8FC7;SB&#x4F2A;&#x5BC4;&#x5B58;&#x5668;&#x5B9A;&#x4F4D;&#x3002;SB&#x662F;Static base pointer&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x610F;&#x4E3A;&#x9759;&#x6001;&#x5185;&#x5B58;&#x7684;&#x5F00;&#x59CB;&#x5730;&#x5740;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;SB&#x60F3;&#x8C61;&#x4E3A;&#x4E00;&#x4E2A;&#x548C;&#x5185;&#x5BB9;&#x5BB9;&#x91CF;&#x6709;&#x76F8;&#x540C;&#x5927;&#x5C0F;&#x7684;&#x5B57;&#x8282;&#x6570;&#x7EC4;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x9759;&#x6001;&#x5168;&#x5C40;&#x7B26;&#x53F7;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;SB&#x52A0;&#x4E00;&#x4E2A;&#x504F;&#x79FB;&#x91CF;&#x5B9A;&#x4F4D;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x7684;&#x7B26;&#x53F7;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;SB&#x5185;&#x5B58;&#x5F00;&#x59CB;&#x5730;&#x5740;&#x504F;&#x79FB;&#x91CF;&#x3002;&#x5BF9;&#x4E8E;SB&#x4F2A;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x5168;&#x5C40;&#x51FD;&#x6570;&#x7684;&#x7B26;&#x53F7;&#x5E76;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x533A;&#x522B;&#x3002;</p>
<p>&#x8981;&#x5B9A;&#x4E49;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5BF9;&#x5E94;&#x7684;&#x7B26;&#x53F7;&#xFF0C;&#x4EE5;&#x53CA;&#x53D8;&#x91CF;&#x5BF9;&#x5E94;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x3002;&#x5BFC;&#x51FA;&#x53D8;&#x91CF;&#x7B26;&#x53F7;&#x7684;&#x8BED;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>GLOBL symbol(SB), width
</code></pre><p>GLOBL&#x6C47;&#x7F16;&#x6307;&#x4EE4;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x540D;&#x4E3A;symbol&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x53D8;&#x91CF;&#x5BF9;&#x5E94;&#x7684;&#x5185;&#x5B58;&#x5BBD;&#x5EA6;&#x4E3A;width&#xFF0C;&#x5185;&#x5B58;&#x5BBD;&#x5EA6;&#x90E8;&#x5206;&#x5FC5;&#x987B;&#x7528;&#x5E38;&#x91CF;&#x521D;&#x59CB;&#x5316;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x901A;&#x8FC7;&#x6C47;&#x7F16;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;int32&#x7C7B;&#x578B;&#x7684;count&#x53D8;&#x91CF;&#xFF1A;</p>
<pre><code>GLOBL &#xB7;count(SB),$4
</code></pre><p>&#x5176;&#x4E2D;&#x7B26;&#x53F7;<code>&#xB7;count</code>&#x4EE5;&#x4E2D;&#x70B9;&#x5F00;&#x5934;&#x8868;&#x793A;&#x662F;&#x5F53;&#x524D;&#x5305;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x6700;&#x7EC8;&#x7B26;&#x53F7;&#x540D;&#x4E3A;&#x88AB;&#x5C55;&#x5F00;&#x4E3A;<code>path/to/pkg.count</code>&#x3002;count&#x53D8;&#x91CF;&#x7684;&#x5927;&#x5C0F;&#x662F;4&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x5E38;&#x91CF;&#x5FC5;&#x987B;&#x4EE5;$&#x7F8E;&#x5143;&#x7B26;&#x53F7;&#x5F00;&#x5934;&#x3002;&#x5185;&#x5B58;&#x7684;&#x5BBD;&#x5EA6;&#x5FC5;&#x987B;&#x662F;2&#x7684;&#x6307;&#x6570;&#x500D;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x6700;&#x7EC8;&#x4F1A;&#x4FDD;&#x8BC1;&#x53D8;&#x91CF;&#x7684;&#x771F;&#x5B9E;&#x5730;&#x5740;&#x5BF9;&#x9F50;&#x5230;&#x673A;&#x5668;&#x5B57;&#x500D;&#x6570;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5728;Go&#x6C47;&#x7F16;&#x4E2D;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x4E3A;count&#x53D8;&#x91CF;&#x6307;&#x5B9A;&#x5177;&#x4F53;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5728;&#x6C47;&#x7F16;&#x4E2D;&#x5B9A;&#x4E49;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x5173;&#x5FC3;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x5B57;&#x548C;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#xFF0C;&#x53D8;&#x91CF;&#x6700;&#x7EC8;&#x7684;&#x7C7B;&#x578B;&#x53EA;&#x80FD;&#x5728;Go&#x8BED;&#x8A00;&#x4E2D;&#x58F0;&#x660E;&#x3002;</p>
<p>&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;DATA&#x6C47;&#x7F16;&#x6307;&#x4EE4;&#x6307;&#x5B9A;&#x5BF9;&#x5E94;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8BED;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>DATA symbol+offset(SB)/width, value
</code></pre><p>&#x5177;&#x4F53;&#x7684;&#x542B;&#x4E49;&#x662F;&#x4ECE;symbol+offset&#x504F;&#x79FB;&#x91CF;&#x5F00;&#x59CB;&#xFF0C;width&#x5BBD;&#x5EA6;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x7528;value&#x5E38;&#x91CF;&#x5BF9;&#x5E94;&#x7684;&#x503C;&#x521D;&#x59CB;&#x5316;&#x3002;DATA&#x521D;&#x59CB;&#x5316;&#x5185;&#x5B58;&#x65F6;&#xFF0C;width&#x5FC5;&#x987B;&#x662F;1&#x3001;2&#x3001;4&#x3001;8&#x51E0;&#x4E2A;&#x5BBD;&#x5EA6;&#x4E4B;&#x4E00;&#xFF0C;&#x56E0;&#x4E3A;&#x518D;&#x5927;&#x7684;&#x5185;&#x5B58;&#x65E0;&#x6CD5;&#x4E00;&#x6B21;&#x6027;&#x7528;&#x4E00;&#x4E2A;uint64&#x5927;&#x5C0F;&#x7684;&#x503C;&#x8868;&#x793A;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;int32&#x7C7B;&#x578B;&#x7684;count&#x53D8;&#x91CF;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x65E2;&#x53EF;&#x4EE5;&#x9010;&#x4E2A;&#x5B57;&#x8282;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x6027;&#x521D;&#x59CB;&#x5316;&#xFF1A;</p>
<pre><code>DATA &#xB7;count+0(SB)/1,$1
DATA &#xB7;count+1(SB)/1,$2
DATA &#xB7;count+2(SB)/1,$3
DATA &#xB7;count+3(SB)/1,$4

// or

DATA &#xB7;count+0(SB)/4,$0x04030201
</code></pre><p>&#x56E0;&#x4E3A;X86&#x5904;&#x7406;&#x5668;&#x662F;&#x5C0F;&#x7AEF;&#x5E8F;&#xFF0C;&#x56E0;&#x6B64;&#x7528;&#x5341;&#x516D;&#x8FDB;&#x5236;0x04030201&#x521D;&#x59CB;&#x5316;&#x5168;&#x90E8;&#x7684;4&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x548C;&#x7528;1&#x3001;2&#x3001;3&#x3001;4&#x9010;&#x4E2A;&#x521D;&#x59CB;&#x5316;4&#x4E2A;&#x5B57;&#x8282;&#x662F;&#x4E00;&#x6837;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>&#x6700;&#x540E;&#x8FD8;&#x9700;&#x8981;&#x5728;Go&#x8BED;&#x8A00;&#x4E2D;&#x58F0;&#x660E;&#x5BF9;&#x5E94;&#x7684;&#x53D8;&#x91CF;&#xFF08;&#x548C;C&#x8BED;&#x8A00;&#x5934;&#x6587;&#x4EF6;&#x58F0;&#x660E;&#x53D8;&#x91CF;&#x7684;&#x4F5C;&#x7528;&#x7C7B;&#x4F3C;&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x4F1A;&#x6839;&#x636E;&#x53D8;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x6765;&#x7BA1;&#x7406;&#x5176;&#x4E2D;&#x7684;&#x6307;&#x9488;&#x76F8;&#x5173;&#x7684;&#x5185;&#x5B58;&#x6570;&#x636E;&#x3002;</p>
<h3 id="3321-&#x6570;&#x7EC4;&#x7C7B;&#x578B;">3.3.2.1 &#x6570;&#x7EC4;&#x7C7B;&#x578B;</h3>
<p>&#x6C47;&#x7F16;&#x4E2D;&#x6570;&#x7EC4;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x7C7B;&#x578B;&#x3002;Go&#x8BED;&#x8A00;&#x4E2D;&#x6570;&#x7EC4;&#x662F;&#x4E00;&#x79CD;&#x6709;&#x7740;&#x6241;&#x5E73;&#x5185;&#x5B58;&#x7ED3;&#x6784;&#x7684;&#x57FA;&#x7840;&#x7C7B;&#x578B;&#x3002;&#x56E0;&#x6B64;<code>[2]byte</code>&#x7C7B;&#x578B;&#x548C;<code>[1]uint16</code>&#x7C7B;&#x578B;&#x6709;&#x7740;&#x76F8;&#x540C;&#x7684;&#x5185;&#x5B58;&#x7ED3;&#x6784;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x6570;&#x7EC4;&#x548C;&#x7ED3;&#x6784;&#x4F53;&#x7ED3;&#x5408;&#x4E4B;&#x540E;&#x60C5;&#x51B5;&#x624D;&#x4F1A;&#x53D8;&#x7684;&#x7A0D;&#x5FAE;&#x590D;&#x6742;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C1D;&#x8BD5;&#x7528;&#x6C47;&#x7F16;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;<code>[2]int</code>&#x7C7B;&#x578B;&#x7684;&#x6570;&#x7EC4;&#x53D8;&#x91CF;num&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">var</span> num [<span class="hljs-number">2</span>]<span class="hljs-keyword">int</span>
</code></pre>
<p>&#x7136;&#x540E;&#x5728;&#x6C47;&#x7F16;&#x4E2D;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5BF9;&#x5E94;16&#x5B57;&#x8282;&#x5927;&#x5C0F;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5E76;&#x7528;&#x96F6;&#x503C;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#xFF1A;</p>
<pre><code>GLOBL &#xB7;num(SB),$16
DATA &#xB7;num+0(SB)/8,$0
DATA &#xB7;num+8(SB)/8,$0
</code></pre><p>&#x4E0B;&#x56FE;&#x662F;Go&#x8BED;&#x53E5;&#x548C;&#x6C47;&#x7F16;&#x8BED;&#x53E5;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x65F6;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#xFF1A;</p>
<p><img src="../images/ch3-4-pkg-var-decl-01.ditaa.png" alt=""></p>
<p><em>&#x56FE; 3-4 &#x53D8;&#x91CF;&#x5B9A;&#x4E49;</em></p>
<p>&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#x4E2D;&#x5E76;&#x4E0D;&#x9700;&#x8981;NOPTR&#x6807;&#x5FD7;&#xFF0C;&#x56E0;&#x4E3A;Go&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x4ECE;Go&#x8BED;&#x8A00;&#x8BED;&#x53E5;&#x58F0;&#x660E;&#x7684;<code>[2]int</code>&#x7C7B;&#x578B;&#x4E2D;&#x63A8;&#x5BFC;&#x51FA;&#x8BE5;&#x53D8;&#x91CF;&#x5185;&#x90E8;&#x6CA1;&#x6709;&#x6307;&#x9488;&#x6570;&#x636E;&#x3002;</p>
<h3 id="3322-bool&#x578B;&#x53D8;&#x91CF;">3.3.2.2 bool&#x578B;&#x53D8;&#x91CF;</h3>
<p>Go&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x65E0;&#x6CD5;&#x6307;&#x5B9A;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5148;&#x901A;&#x8FC7;Go&#x8BED;&#x8A00;&#x58F0;&#x660E;&#x53D8;&#x91CF;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x5728;Go&#x8BED;&#x8A00;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#x51E0;&#x4E2A;bool&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">var</span> (
    boolValue  <span class="hljs-keyword">bool</span>
    trueValue  <span class="hljs-keyword">bool</span>
    falseValue <span class="hljs-keyword">bool</span>
)
</code></pre>
<p>&#x5728;Go&#x8BED;&#x8A00;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#x53D8;&#x91CF;&#x4E0D;&#x80FD;&#x542B;&#x6709;&#x521D;&#x59CB;&#x5316;&#x8BED;&#x53E5;&#x3002;&#x7136;&#x540E;&#x4E0B;&#x9762;&#x662F;amd64&#x73AF;&#x5883;&#x7684;&#x6C47;&#x7F16;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code>GLOBL &#xB7;boolValue(SB),$1   // &#x672A;&#x521D;&#x59CB;&#x5316;

GLOBL &#xB7;trueValue(SB),$1   // var trueValue = true
DATA &#xB7;trueValue(SB)/1,$1  // &#x975E; 0 &#x5747;&#x4E3A; true

GLOBL &#xB7;falseValue(SB),$1  // var falseValue = true
DATA &#xB7;falseValue(SB)/1,$0
</code></pre><p>bool&#x7C7B;&#x578B;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x4E3A;1&#x4E2A;&#x5B57;&#x8282;&#x3002;&#x5E76;&#x4E14;&#x6C47;&#x7F16;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x9700;&#x8981;&#x624B;&#x5DE5;&#x6307;&#x5B9A;&#x521D;&#x59CB;&#x5316;&#x503C;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x4EA7;&#x751F;&#x672A;&#x521D;&#x59CB;&#x5316;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x5F53;&#x9700;&#x8981;&#x5C06;1&#x4E2A;&#x5B57;&#x8282;&#x7684;bool&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x52A0;&#x8F7D;&#x5230;8&#x5B57;&#x8282;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528;MOVBQZX&#x6307;&#x4EE4;&#x5C06;&#x4E0D;&#x8DB3;&#x7684;&#x9AD8;&#x4F4D;&#x7528;0&#x586B;&#x5145;&#x3002;</p>
<h3 id="3323-int&#x578B;&#x53D8;&#x91CF;">3.3.2.3 int&#x578B;&#x53D8;&#x91CF;</h3>
<p>&#x6240;&#x6709;&#x7684;&#x6574;&#x6570;&#x7C7B;&#x578B;&#x5747;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x5B9A;&#x4E49;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x5DEE;&#x5F02;&#x662F;&#x6574;&#x6570;&#x7C7B;&#x578B;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x548C;&#x6574;&#x6570;&#x662F;&#x5426;&#x662F;&#x6709;&#x7B26;&#x53F7;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x58F0;&#x660E;&#x7684;int32&#x548C;uint32&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">var</span> int32Value <span class="hljs-keyword">int32</span>

<span class="hljs-keyword">var</span> uint32Value <span class="hljs-keyword">uint32</span>
</code></pre>
<p>&#x5728;Go&#x8BED;&#x8A00;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#x53D8;&#x91CF;&#x4E0D;&#x80FD;&#x542B;&#x6709;&#x521D;&#x59CB;&#x5316;&#x8BED;&#x53E5;&#x3002;&#x7136;&#x540E;&#x4E0B;&#x9762;&#x662F;amd64&#x73AF;&#x5883;&#x7684;&#x6C47;&#x7F16;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code>GLOBL &#xB7;int32Value(SB),$4
DATA &#xB7;int32Value+0(SB)/1,$0x01  // &#x7B2C;0&#x5B57;&#x8282;
DATA &#xB7;int32Value+1(SB)/1,$0x02  // &#x7B2C;1&#x5B57;&#x8282;
DATA &#xB7;int32Value+2(SB)/2,$0x03  // &#x7B2C;3-4&#x5B57;&#x8282;

GLOBL &#xB7;uint32Value(SB),$4
DATA &#xB7;uint32Value(SB)/4,$0x01020304 // &#x7B2C;1-4&#x5B57;&#x8282;
</code></pre><p>&#x6C47;&#x7F16;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x65F6;&#x521D;&#x59CB;&#x5316;&#x6570;&#x636E;&#x5E76;&#x4E0D;&#x533A;&#x5206;&#x6574;&#x6570;&#x662F;&#x5426;&#x6709;&#x7B26;&#x53F7;&#x3002;&#x53EA;&#x6709;&#x5728;CPU&#x6307;&#x4EE4;&#x5904;&#x7406;&#x8BE5;&#x5BC4;&#x5B58;&#x5668;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x624D;&#x4F1A;&#x6839;&#x636E;&#x6307;&#x4EE4;&#x7684;&#x7C7B;&#x578B;&#x6765;&#x53D6;&#x5206;&#x6570;&#x636E;&#x7684;&#x7C7B;&#x578B;&#x6216;&#x8005;&#x662F;&#x5426;&#x5E26;&#x6709;&#x7B26;&#x53F7;&#x4F4D;&#x3002;</p>
<h3 id="3324-float&#x578B;&#x53D8;&#x91CF;">3.3.2.4 float&#x578B;&#x53D8;&#x91CF;</h3>
<p>Go&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x901A;&#x5E38;&#x65E0;&#x6CD5;&#x533A;&#x5206;&#x53D8;&#x91CF;&#x662F;&#x5426;&#x662F;&#x6D6E;&#x70B9;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x4E0E;&#x4E4B;&#x76F8;&#x5173;&#x7684;&#x6D6E;&#x70B9;&#x6570;&#x673A;&#x5668;&#x6307;&#x4EE4;&#x4F1A;&#x5C06;&#x53D8;&#x91CF;&#x5F53;&#x4F5C;&#x6D6E;&#x70B9;&#x6570;&#x5904;&#x7406;&#x3002;Go&#x8BED;&#x8A00;&#x7684;&#x6D6E;&#x70B9;&#x6570;&#x9075;&#x5FAA;IEEE754&#x6807;&#x51C6;&#xFF0C;&#x6709;float32&#x5355;&#x7CBE;&#x5EA6;&#x6D6E;&#x70B9;&#x6570;&#x548C;float64&#x53CC;&#x7CBE;&#x5EA6;&#x6D6E;&#x70B9;&#x6570;&#x4E4B;&#x5206;&#x3002;</p>
<p>IEEE754&#x6807;&#x51C6;&#x4E2D;&#xFF0C;&#x6700;&#x9AD8;&#x4F4D;1bit&#x4E3A;&#x7B26;&#x53F7;&#x4F4D;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x6307;&#x6570;&#x4F4D;&#xFF08;&#x6307;&#x6570;&#x4E3A;&#x91C7;&#x7528;&#x79FB;&#x7801;&#x683C;&#x5F0F;&#x8868;&#x793A;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x6709;&#x6548;&#x6570;&#x90E8;&#x5206;&#xFF08;&#x5176;&#x4E2D;&#x5C0F;&#x6570;&#x70B9;&#x5DE6;&#x8FB9;&#x7684;&#x4E00;&#x4E2A;bit&#x4F4D;&#x88AB;&#x7701;&#x7565;&#xFF09;&#x3002;&#x4E0B;&#x56FE;&#x662F;IEEE754&#x4E2D;float32&#x7C7B;&#x578B;&#x6D6E;&#x70B9;&#x6570;&#x7684;bit&#x5E03;&#x5C40;&#xFF1A;</p>
<p><img src="../images/ch3-5-ieee754.jpg" alt=""></p>
<p><em>&#x56FE; 3-5 IEEE754&#x6D6E;&#x70B9;&#x6570;&#x7ED3;&#x6784;</em></p>
<p>IEEE754&#x6D6E;&#x70B9;&#x6570;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5947;&#x5999;&#x7684;&#x7279;&#x6027;&#xFF1A;&#x6BD4;&#x5982;&#x6709;&#x6B63;&#x8D1F;&#x4E24;&#x4E2A;0&#xFF1B;&#x9664;&#x4E86;&#x65E0;&#x7A77;&#x5927;&#x548C;&#x65E0;&#x7A77;&#x5C0F;Inf&#x8FD8;&#x6709;&#x975E;&#x6570;NaN&#xFF1B;&#x540C;&#x65F6;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x6D6E;&#x70B9;&#x6570;&#x6709;&#x5E8F;&#x90A3;&#x4E48;&#x5BF9;&#x5E94;&#x7684;&#x6709;&#x7B26;&#x53F7;&#x6574;&#x6570;&#x4E5F;&#x662F;&#x6709;&#x5E8F;&#x7684;&#xFF08;&#x53CD;&#x4E4B;&#x5219;&#x4E0D;&#x4E00;&#x5B9A;&#x6210;&#x7ACB;&#xFF0C;&#x56E0;&#x4E3A;&#x6D6E;&#x70B9;&#x6570;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x975E;&#x6570;&#x662F;&#x4E0D;&#x53EF;&#x6392;&#x5E8F;&#x7684;&#xFF09;&#x3002;&#x6D6E;&#x70B9;&#x6570;&#x662F;&#x7A0B;&#x5E8F;&#x4E2D;&#x6700;&#x96BE;&#x7422;&#x78E8;&#x7684;&#x89D2;&#x843D;&#xFF0C;&#x56E0;&#x4E3A;&#x7A0B;&#x5E8F;&#x4E2D;&#x5F88;&#x591A;&#x624B;&#x5199;&#x7684;&#x6D6E;&#x70B9;&#x6570;&#x5B57;&#x9762;&#x503C;&#x5E38;&#x91CF;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x7CBE;&#x786E;&#x8868;&#x8FBE;&#xFF0C;&#x6D6E;&#x70B9;&#x6570;&#x8BA1;&#x7B97;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x8BEF;&#x5DEE;&#x820D;&#x5165;&#x65B9;&#x5F0F;&#x53EF;&#x80FD;&#x4E5F;&#x7684;&#x968F;&#x673A;&#x7684;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x5728;Go&#x8BED;&#x8A00;&#x4E2D;&#x58F0;&#x660E;&#x4E24;&#x4E2A;&#x6D6E;&#x70B9;&#x6570;&#xFF08;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5728;&#x6C47;&#x7F16;&#x4E2D;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#xFF0C;&#x90A3;&#x4E48;&#x58F0;&#x660E;&#x7684;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#xFF09;&#x3002;</p>
<pre><code class="lang-go"><span class="hljs-keyword">var</span> float32Value <span class="hljs-keyword">float32</span>

<span class="hljs-keyword">var</span> float64Value <span class="hljs-keyword">float64</span>
</code></pre>
<p>&#x7136;&#x540E;&#x5728;&#x6C47;&#x7F16;&#x4E2D;&#x5B9A;&#x4E49;&#x5E76;&#x521D;&#x59CB;&#x5316;&#x4E0A;&#x9762;&#x58F0;&#x660E;&#x7684;&#x4E24;&#x4E2A;&#x6D6E;&#x70B9;&#x6570;&#xFF1A;</p>
<pre><code>GLOBL &#xB7;float32Value(SB),$4
DATA &#xB7;float32Value+0(SB)/4,$1.5      // var float32Value = 1.5

GLOBL &#xB7;float64Value(SB),$8
DATA &#xB7;float64Value(SB)/8,$0x01020304 // bit &#x65B9;&#x5F0F;&#x521D;&#x59CB;&#x5316;
</code></pre><p>&#x6211;&#x4EEC;&#x5728;&#x4E0A;&#x4E00;&#x8282;&#x7CBE;&#x7B80;&#x7684;&#x7B97;&#x672F;&#x6307;&#x4EE4;&#x4E2D;&#x90FD;&#x662F;&#x9488;&#x5BF9;&#x6574;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x901A;&#x8FC7;&#x6574;&#x6570;&#x6307;&#x4EE4;&#x5904;&#x7406;&#x6D6E;&#x70B9;&#x6570;&#x7684;&#x52A0;&#x51CF;&#x6CD5;&#x5FC5;&#x987B;&#x6839;&#x636E;&#x6D6E;&#x70B9;&#x6570;&#x7684;&#x8FD0;&#x7B97;&#x89C4;&#x5219;&#x8FDB;&#x884C;&#xFF1A;&#x5148;&#x5BF9;&#x9F50;&#x5C0F;&#x6570;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x6574;&#x6570;&#x52A0;&#x51CF;&#x6CD5;&#xFF0C;&#x6700;&#x540E;&#x518D;&#x5BF9;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x5F52;&#x4E00;&#x5316;&#x5E76;&#x5904;&#x7406;&#x7CBE;&#x5EA6;&#x820D;&#x5165;&#x95EE;&#x9898;&#x3002;&#x4E0D;&#x8FC7;&#x5728;&#x76EE;&#x524D;&#x7684;&#x4E3B;&#x6D41;CPU&#x4E2D;&#xFF0C;&#x90FD;&#x63D0;&#x9488;&#x5BF9;&#x6D6E;&#x70B9;&#x6570;&#x63D0;&#x4F9B;&#x4E86;&#x4E13;&#x6709;&#x7684;&#x8BA1;&#x7B97;&#x6307;&#x4EE4;&#x3002;</p>
<h3 id="3325-string&#x7C7B;&#x578B;&#x53D8;&#x91CF;">3.3.2.5 string&#x7C7B;&#x578B;&#x53D8;&#x91CF;</h3>
<p>&#x4ECE;Go&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x7ED3;&#x6784;&#x4F53;&#x3002;string&#x7684;&#x5934;&#x7ED3;&#x6784;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">type</span> reflect.StringHeader <span class="hljs-keyword">struct</span> {
    Data <span class="hljs-keyword">uintptr</span>
    Len  <span class="hljs-keyword">int</span>
}
</code></pre>
<p>&#x5728;amd64&#x73AF;&#x5883;&#x4E2D;StringHeader&#x6709;16&#x4E2A;&#x5B57;&#x8282;&#x5927;&#x5C0F;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x5148;&#x5728;Go&#x4EE3;&#x7801;&#x58F0;&#x660E;&#x5B57;&#x7B26;&#x4E32;&#x53D8;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6C47;&#x7F16;&#x4E2D;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;16&#x5B57;&#x8282;&#x5927;&#x5C0F;&#x7684;&#x53D8;&#x91CF;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">var</span> helloworld <span class="hljs-keyword">string</span>
</code></pre>
<pre><code>GLOBL &#xB7;helloworld(SB),$16
</code></pre><p>&#x540C;&#x65F6;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x51C6;&#x5907;&#x771F;&#x6B63;&#x7684;&#x6570;&#x636E;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;text&#x5F53;&#x524D;&#x6587;&#x4EF6;&#x5185;&#x7684;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#xFF08;&#x4EE5;<code>&lt;&gt;</code>&#x4E3A;&#x540E;&#x7F00;&#x540D;&#xFF09;&#xFF0C;&#x5185;&#x5BB9;&#x4E3A;&#x201C;Hello World!&#x201D;&#xFF1A;</p>
<pre><code>GLOBL text&lt;&gt;(SB),NOPTR,$16
DATA text&lt;&gt;+0(SB)/8,$&quot;Hello Wo&quot;
DATA text&lt;&gt;+8(SB)/8,$&quot;rld!&quot;
</code></pre><p>&#x867D;&#x7136;<code>text&lt;&gt;</code>&#x79C1;&#x6709;&#x53D8;&#x91CF;&#x8868;&#x793A;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x53EA;&#x6709;12&#x4E2A;&#x5B57;&#x7B26;&#x957F;&#x5EA6;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x4F9D;&#x7136;&#x9700;&#x8981;&#x5C06;&#x53D8;&#x91CF;&#x7684;&#x957F;&#x5EA6;&#x6269;&#x5C55;&#x4E3A;2&#x7684;&#x6307;&#x6570;&#x500D;&#x6570;&#xFF0C;&#x8FD9;&#x91CC;&#x4E5F;&#x5C31;&#x662F;16&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x957F;&#x5EA6;&#x3002;&#x5176;&#x4E2D;<code>NOPTR</code>&#x8868;&#x793A;<code>text&lt;&gt;</code>&#x4E0D;&#x5305;&#x542B;&#x6307;&#x9488;&#x6570;&#x636E;&#x3002;</p>
<p>&#x7136;&#x540E;&#x4F7F;&#x7528;text&#x79C1;&#x6709;&#x53D8;&#x91CF;&#x5BF9;&#x5E94;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x5BF9;&#x5E94;&#x7684;&#x5E38;&#x91CF;&#x6765;&#x521D;&#x59CB;&#x5316;&#x5B57;&#x7B26;&#x4E32;&#x5934;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;&#x7684;Data&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x4E14;&#x624B;&#x5DE5;&#x6307;&#x5B9A;Len&#x90E8;&#x5206;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x957F;&#x5EA6;&#xFF1A;</p>
<pre><code>DATA &#xB7;helloworld+0(SB)/8,$text&lt;&gt;(SB) // StringHeader.Data
DATA &#xB7;helloworld+8(SB)/8,$12         // StringHeader.Len
</code></pre><p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x53EA;&#x8BFB;&#x7C7B;&#x578B;&#xFF0C;&#x8981;&#x907F;&#x514D;&#x5728;&#x6C47;&#x7F16;&#x4E2D;&#x76F4;&#x63A5;&#x4FEE;&#x6539;&#x5B57;&#x7B26;&#x4E32;&#x5E95;&#x5C42;&#x6570;&#x636E;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<h3 id="3326-slice&#x7C7B;&#x578B;&#x53D8;&#x91CF;">3.3.2.6 slice&#x7C7B;&#x578B;&#x53D8;&#x91CF;</h3>
<p>slice&#x53D8;&#x91CF;&#x548C;string&#x53D8;&#x91CF;&#x76F8;&#x4F3C;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x5207;&#x7247;&#x5934;&#x7ED3;&#x6784;&#x4F53;&#x800C;&#x5DF2;&#x3002;&#x5207;&#x7247;&#x5934;&#x7684;&#x7ED3;&#x6784;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">type</span> reflect.SliceHeader <span class="hljs-keyword">struct</span> {
    Data <span class="hljs-keyword">uintptr</span>
    Len  <span class="hljs-keyword">int</span>
    Cap  <span class="hljs-keyword">int</span>
}
</code></pre>
<p>&#x5BF9;&#x6BD4;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x5207;&#x7247;&#x7684;&#x5934;&#x7684;&#x524D;2&#x4E2A;&#x6210;&#x5458;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x524D;&#x9762;&#x5B57;&#x7B26;&#x4E32;&#x53D8;&#x91CF;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x518D;&#x6269;&#x5C55;&#x4E00;&#x4E2A;Cap&#x6210;&#x5458;&#x5C31;&#x6210;&#x4E86;&#x5207;&#x7247;&#x7C7B;&#x578B;&#x4E86;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">var</span> helloworld []<span class="hljs-keyword">byte</span>
</code></pre>
<pre><code>GLOBL &#xB7;helloworld(SB),$24            // var helloworld []byte(&quot;Hello World!&quot;)
DATA &#xB7;helloworld+0(SB)/8,$text&lt;&gt;(SB) // StringHeader.Data
DATA &#xB7;helloworld+8(SB)/8,$12         // StringHeader.Len
DATA &#xB7;helloworld+16(SB)/8,$16        // StringHeader.Cap

GLOBL text&lt;&gt;(SB),$16
DATA text&lt;&gt;+0(SB)/8,$&quot;Hello Wo&quot;      // ...string data...
DATA text&lt;&gt;+8(SB)/8,$&quot;rld!&quot;          // ...string data...
</code></pre><p>&#x56E0;&#x4E3A;&#x5207;&#x7247;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x76F8;&#x5BB9;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5207;&#x7247;&#x5934;&#x7684;&#x524D;16&#x4E2A;&#x5B57;&#x8282;&#x4E34;&#x65F6;&#x4F5C;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x4F7F;&#x7528;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x7701;&#x53BB;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x8F6C;&#x6362;&#x3002;</p>
<h3 id="3327-mapchannel&#x7C7B;&#x578B;&#x53D8;&#x91CF;">3.3.2.7 map/channel&#x7C7B;&#x578B;&#x53D8;&#x91CF;</h3>
<p>map/channel&#x7B49;&#x7C7B;&#x578B;&#x5E76;&#x6CA1;&#x6709;&#x516C;&#x5F00;&#x7684;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#xFF0C;&#x5B83;&#x4EEC;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x672A;&#x77E5;&#x7C7B;&#x578B;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x521D;&#x59CB;&#x5316;&#x3002;&#x5728;&#x6C47;&#x7F16;&#x4EE3;&#x7801;&#x4E2D;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x4E3A;&#x7C7B;&#x4F3C;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x5E76;&#x8FDB;&#x884C;0&#x503C;&#x521D;&#x59CB;&#x5316;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">var</span> m <span class="hljs-keyword">map</span>[<span class="hljs-keyword">string</span>]<span class="hljs-keyword">int</span>

<span class="hljs-keyword">var</span> ch <span class="hljs-keyword">chan</span> <span class="hljs-keyword">int</span>
</code></pre>
<pre><code>GLOBL &#xB7;m(SB),$8  // var m map[string]int
DATA  &#xB7;m+0(SB)/8,$0

GLOBL &#xB7;ch(SB),$8 // var ch chan int
DATA  &#xB7;ch+0(SB)/8,$0
</code></pre><p>&#x5176;&#x5B9E;&#x5728;runtime&#x5305;&#x4E2D;&#x4E3A;&#x6C47;&#x7F16;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x8F85;&#x52A9;&#x51FD;&#x6570;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x6C47;&#x7F16;&#x4E2D;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;runtime.makemap&#x548C;runtime.makechan&#x5185;&#x90E8;&#x51FD;&#x6570;&#x6765;&#x521B;&#x5EFA;map&#x548C;chan&#x53D8;&#x91CF;&#x3002;&#x8F85;&#x52A9;&#x51FD;&#x6570;&#x7684;&#x7B7E;&#x540D;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">func</span> makemap(mapType *<span class="hljs-keyword">byte</span>, hint <span class="hljs-keyword">int</span>, mapbuf *any) (hmap <span class="hljs-keyword">map</span>[any]any)
<span class="hljs-keyword">func</span> makechan(chanType *<span class="hljs-keyword">byte</span>, size <span class="hljs-keyword">int</span>) (hchan <span class="hljs-keyword">chan</span> any)
</code></pre>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;makemap&#x662F;&#x4E00;&#x79CD;&#x8303;&#x578B;&#x51FD;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;map&#xFF0C;map&#x7684;&#x5177;&#x4F53;&#x7C7B;&#x578B;&#x662F;&#x901A;&#x8FC7;mapType&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x3002;</p>
<h2 id="333-&#x53D8;&#x91CF;&#x7684;&#x5185;&#x5B58;&#x5E03;&#x5C40;">3.3.3 &#x53D8;&#x91CF;&#x7684;&#x5185;&#x5B58;&#x5E03;&#x5C40;</h2>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x591A;&#x6B21;&#x5F3A;&#x8C03;&#xFF0C;&#x5728;Go&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x4E2D;&#x53D8;&#x91CF;&#x662F;&#x6CA1;&#x6709;&#x7C7B;&#x578B;&#x7684;&#x3002;&#x56E0;&#x6B64;&#x5728;Go&#x8BED;&#x8A00;&#x4E2D;&#x6709;&#x7740;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5E95;&#x5C42;&#x53EF;&#x80FD;&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x76F8;&#x540C;&#x7684;&#x5185;&#x5B58;&#x7ED3;&#x6784;&#x3002;&#x6DF1;&#x523B;&#x7406;&#x89E3;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#x662F;&#x6C47;&#x7F16;&#x7F16;&#x7A0B;&#x65F6;&#x7684;&#x5FC5;&#x5907;&#x6761;&#x4EF6;&#x3002;</p>
<p>&#x9996;&#x5148;&#x67E5;&#x770B;&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x89C1;&#x8FC7;&#x7684;<code>[2]int</code>&#x7C7B;&#x578B;&#x6570;&#x7EC4;&#x7684;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#xFF1A;</p>
<p><img src="../images/ch3-6-pkg-var-decl-02.ditaa.png" alt=""></p>
<p><em>&#x56FE; 3-6 &#x53D8;&#x91CF;&#x5B9A;&#x4E49;</em></p>
<p>&#x53D8;&#x91CF;&#x5728;data&#x6BB5;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#xFF0C;&#x6570;&#x7EC4;&#x7684;&#x5143;&#x7D20;&#x5730;&#x5740;&#x4F9D;&#x6B21;&#x4ECE;&#x4F4E;&#x5411;&#x9AD8;&#x6392;&#x5217;&#x3002;</p>
<p>&#x7136;&#x540E;&#x518D;&#x67E5;&#x770B;&#x4E0B;&#x6807;&#x51C6;&#x5E93;&#x56FE;&#x50CF;&#x5305;&#x4E2D;<code>image.Point</code>&#x7ED3;&#x6784;&#x4F53;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x7684;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#xFF1A;</p>
<p><img src="../images/ch3-7-pkg-var-decl-03.ditaa.png" alt=""></p>
<p><em>&#x56FE; 3-7 &#x7ED3;&#x6784;&#x4F53;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;</em></p>
<p>&#x53D8;&#x91CF;&#x4E5F;&#x65F6;&#x5728;data&#x6BB5;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#xFF0C;&#x53D8;&#x91CF;&#x7ED3;&#x6784;&#x4F53;&#x6210;&#x5458;&#x7684;&#x5730;&#x5740;&#x4E5F;&#x662F;&#x4F9D;&#x6B21;&#x4ECE;&#x4F4E;&#x5411;&#x9AD8;&#x6392;&#x5217;&#x3002;</p>
<p>&#x56E0;&#x6B64;<code>[2]int</code>&#x548C;<code>image.Point</code>&#x7C7B;&#x578B;&#x5E95;&#x5C42;&#x6709;&#x7740;&#x8FD1;&#x4F3C;&#x76F8;&#x540C;&#x7684;&#x5185;&#x5B58;&#x5E03;&#x5C40;&#x3002;</p>
<h2 id="334-&#x6807;&#x8BC6;&#x7B26;&#x89C4;&#x5219;&#x548C;&#x7279;&#x6B8A;&#x6807;&#x5FD7;">3.3.4 &#x6807;&#x8BC6;&#x7B26;&#x89C4;&#x5219;&#x548C;&#x7279;&#x6B8A;&#x6807;&#x5FD7;</h2>
<p>Go&#x8BED;&#x8A00;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x53EF;&#x4EE5;&#x7531;&#x7EDD;&#x5BF9;&#x7684;&#x5305;&#x8DEF;&#x5F84;&#x52A0;&#x6807;&#x8BC6;&#x7B26;&#x672C;&#x8EAB;&#x5B9A;&#x4F4D;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x540C;&#x5305;&#x4E2D;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x5373;&#x4F7F;&#x540C;&#x540D;&#x4E5F;&#x4E0D;&#x4F1A;&#x6709;&#x95EE;&#x9898;&#x3002;Go&#x6C47;&#x7F16;&#x662F;&#x901A;&#x8FC7;&#x7279;&#x6B8A;&#x7684;&#x7B26;&#x53F7;&#x6765;&#x8868;&#x793A;&#x659C;&#x6760;&#x548C;&#x70B9;&#x7B26;&#x53F7;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x6C47;&#x7F16;&#x5668;&#x8BCD;&#x6CD5;&#x626B;&#x63CF;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x7684;&#x7F16;&#x5199;&#xFF0C;&#x53EA;&#x8981;&#x901A;&#x8FC7;&#x5B57;&#x7B26;&#x4E32;&#x66FF;&#x6362;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x6C47;&#x7F16;&#x4E2D;&#x5E38;&#x89C1;&#x7684;&#x51E0;&#x79CD;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#xFF08;&#x901A;&#x5E38;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x51FD;&#x6570;&#x6807;&#x8BC6;&#x7B26;&#xFF09;&#xFF1A;</p>
<pre><code>GLOBL &#xB7;pkg_name1(SB),$1
GLOBL main&#xB7;pkg_name2(SB),$1
GLOBL my/pkg&#xB7;pkg_name(SB),$1
</code></pre><p>&#x6B64;&#x5916;&#xFF0C;Go&#x6C47;&#x7F16;&#x4E2D;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4EC5;&#x5F53;&#x524D;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7684;&#x79C1;&#x6709;&#x6807;&#x8BC6;&#x7B26;&#xFF08;&#x7C7B;&#x4F3C;C&#x8BED;&#x8A00;&#x4E2D;&#x6587;&#x4EF6;&#x5185;static&#x4FEE;&#x9970;&#x7684;&#x53D8;&#x91CF;&#xFF09;&#xFF0C;&#x4EE5;<code>&lt;&gt;</code>&#x4E3A;&#x540E;&#x7F00;&#x540D;&#xFF1A;</p>
<pre><code>GLOBL file_private&lt;&gt;(SB),$1
</code></pre><p>&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x79C1;&#x6709;&#x6807;&#x8BC6;&#x7B26;&#x5BF9;&#x5176;&#x5B83;&#x6587;&#x4EF6;&#x5185;&#x6807;&#x8BC6;&#x7B26;&#x547D;&#x540D;&#x7684;&#x5E72;&#x6270;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;Go&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x8FD8;&#x5728;&quot;textflag.h&quot;&#x6587;&#x4EF6;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E9B;&#x6807;&#x5FD7;&#x3002;&#x5176;&#x4E2D;&#x7528;&#x4E8E;&#x53D8;&#x91CF;&#x7684;&#x6807;&#x5FD7;&#x6709;DUPOK&#x3001;RODATA&#x548C;NOPTR&#x51E0;&#x4E2A;&#x3002;DUPOK&#x8868;&#x793A;&#x8BE5;&#x53D8;&#x91CF;&#x5BF9;&#x5E94;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#xFF0C;&#x5728;&#x94FE;&#x63A5;&#x65F6;&#x53EA;&#x9009;&#x62E9;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5373;&#x53EF;&#xFF08;&#x4E00;&#x822C;&#x7528;&#x4E8E;&#x5408;&#x5E76;&#x76F8;&#x540C;&#x7684;&#x5E38;&#x91CF;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x51CF;&#x5C11;&#x91CD;&#x590D;&#x6570;&#x636E;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#xFF09;&#x3002;RODATA&#x6807;&#x5FD7;&#x8868;&#x793A;&#x5C06;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x5728;&#x53EA;&#x8BFB;&#x5185;&#x5B58;&#x6BB5;&#xFF0C;&#x56E0;&#x6B64;&#x540E;&#x7EED;&#x4EFB;&#x4F55;&#x5BF9;&#x6B64;&#x53D8;&#x91CF;&#x7684;&#x4FEE;&#x6539;&#x64CD;&#x4F5C;&#x5C06;&#x5BFC;&#x81F4;&#x5F02;&#x5E38;&#xFF08;recover&#x4E5F;&#x65E0;&#x6CD5;&#x6355;&#x83B7;&#xFF09;&#x3002;NOPTR&#x5219;&#x8868;&#x793A;&#x6B64;&#x53D8;&#x91CF;&#x7684;&#x5185;&#x90E8;&#x4E0D;&#x542B;&#x6307;&#x9488;&#x6570;&#x636E;&#xFF0C;&#x8BA9;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x5FFD;&#x7565;&#x5BF9;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x626B;&#x63CF;&#x3002;&#x5982;&#x679C;&#x53D8;&#x91CF;&#x5DF2;&#x7ECF;&#x5728;Go&#x4EE3;&#x7801;&#x4E2D;&#x58F0;&#x660E;&#x8FC7;&#x7684;&#x8BDD;&#xFF0C;Go&#x7F16;&#x8BD1;&#x5668;&#x4F1A;&#x81EA;&#x52A8;&#x5206;&#x6790;&#x51FA;&#x8BE5;&#x53D8;&#x91CF;&#x662F;&#x5426;&#x5305;&#x542B;&#x6307;&#x9488;&#xFF0C;&#x8FD9;&#x79CD;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x624B;&#x5199;NOPTR&#x6807;&#x5FD7;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#x901A;&#x8FC7;&#x6C47;&#x7F16;&#x6765;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x53EA;&#x8BFB;&#x7684;int&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">var</span> const_id <span class="hljs-keyword">int</span> <span class="hljs-comment">// readonly</span>
</code></pre>
<pre><code>#include &quot;textflag.h&quot;

GLOBL &#xB7;const_id(SB),NOPTR|RODATA,$8
DATA  &#xB7;const_id+0(SB)/8,$9527
</code></pre><p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;#include&#x8BED;&#x53E5;&#x5305;&#x542B;&#x5B9A;&#x4E49;&#x6807;&#x5FD7;&#x7684;&quot;textflag.h&quot;&#x5934;&#x6587;&#x4EF6;&#xFF08;&#x548C;C&#x8BED;&#x8A00;&#x4E2D;&#x9884;&#x5904;&#x7406;&#x76F8;&#x540C;&#xFF09;&#x3002;&#x7136;&#x540E;GLOBL&#x6C47;&#x7F16;&#x547D;&#x4EE4;&#x5728;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x7ED9;&#x53D8;&#x91CF;&#x589E;&#x52A0;&#x4E86;NOPTR&#x548C;RODATA&#x4E24;&#x4E2A;&#x6807;&#x5FD7;&#xFF08;&#x591A;&#x4E2A;&#x6807;&#x5FD7;&#x4E4B;&#x95F4;&#x91C7;&#x7528;&#x7AD6;&#x6760;&#x5206;&#x5272;&#xFF09;&#xFF0C;&#x8868;&#x793A;&#x53D8;&#x91CF;&#x4E2D;&#x6CA1;&#x6709;&#x6307;&#x9488;&#x6570;&#x636E;&#x540C;&#x65F6;&#x5B9A;&#x4E49;&#x5728;&#x53EA;&#x8BFB;&#x6570;&#x636E;&#x6BB5;&#x3002;</p>
<p>&#x53D8;&#x91CF;&#x4E00;&#x822C;&#x4E5F;&#x53EB;&#x53EF;&#x53D6;&#x5730;&#x5740;&#x7684;&#x503C;&#xFF0C;&#x4F46;&#x662F;const_id&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x53D6;&#x5730;&#x5740;&#xFF0C;&#x4F46;&#x662F;&#x786E;&#x5B9E;&#x4E0D;&#x80FD;&#x4FEE;&#x6539;&#x3002;&#x4E0D;&#x80FD;&#x4FEE;&#x6539;&#x7684;&#x9650;&#x5236;&#x5E76;&#x4E0D;&#x662F;&#x7531;&#x7F16;&#x8BD1;&#x5668;&#x63D0;&#x4F9B;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x5BF9;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x4FEE;&#x6539;&#x4F1A;&#x5BFC;&#x81F4;&#x5BF9;&#x53EA;&#x8BFB;&#x5185;&#x5B58;&#x6BB5;&#x8FDB;&#x884C;&#x5199;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x5F02;&#x5E38;&#x3002;</p>
<h2 id="335-&#x5C0F;&#x7ED3;">3.3.5 &#x5C0F;&#x7ED3;</h2>
<p>&#x4EE5;&#x4E0A;&#x6211;&#x4EEC;&#x521D;&#x6B65;&#x5C55;&#x793A;&#x4E86;&#x901A;&#x8FC7;&#x6C47;&#x7F16;&#x5B9A;&#x4E49;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x7528;&#x6CD5;&#x3002;&#x4F46;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x63A8;&#x8350;&#x901A;&#x8FC7;&#x6C47;&#x7F16;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x2014;&#x2014;&#x56E0;&#x4E3A;&#x7528;Go&#x8BED;&#x8A00;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x548C;&#x5B89;&#x5168;&#x3002;&#x5728;Go&#x8BED;&#x8A00;&#x4E2D;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x8BA1;&#x7B97;&#x597D;&#x53D8;&#x91CF;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x751F;&#x6210;&#x53D8;&#x91CF;&#x7684;&#x521D;&#x59CB;&#x503C;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5305;&#x542B;&#x4E86;&#x8DB3;&#x591F;&#x7684;&#x7C7B;&#x578B;&#x4FE1;&#x606F;&#x3002;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x7684;&#x4F18;&#x52BF;&#x662F;&#x6316;&#x6398;&#x673A;&#x5668;&#x7684;&#x7279;&#x6027;&#x548C;&#x6027;&#x80FD;&#xFF0C;&#x7528;&#x6C47;&#x7F16;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x5219;&#x65E0;&#x6CD5;&#x53D1;&#x6325;&#x8FD9;&#x4E9B;&#x4F18;&#x52BF;&#x3002;&#x56E0;&#x6B64;&#x5728;&#x7406;&#x89E3;&#x4E86;&#x6C47;&#x7F16;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x7684;&#x7528;&#x6CD5;&#x540E;&#xFF0C;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#x8C28;&#x614E;&#x4F7F;&#x7528;&#x3002;</p>

                            </div>
                            
                        
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                    </div>
                </div>
            </div>
        </div>
    </div>
</div>

<script src="../gitbook/gitbook.js"></script>

    
    <script src="../gitbook/gitbook-plugin-bg-nest/bg-nest.min.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-bg-nest/init.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
    

<script>
(function() {
    gitbook.page.hasChanged({"page":{"title":"3.3 常量和全局变量","level":"1.4.3","depth":2,"next":{"title":"3.4 函数","level":"1.4.4","depth":2,"path":"ch3-asm/ch3-04-func.md","ref":"ch3-asm/ch3-04-func.md","articles":[]},"previous":{"title":"3.2 计算机结构","level":"1.4.2","depth":2,"path":"ch3-asm/ch3-02-arch.md","ref":"ch3-asm/ch3-02-arch.md","articles":[]},"dir":"ltr"},"config":{"plugins":["theme-opendocs","bg-nest","-lunr","-search","search-pro","-sharing","-fontsettings"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"bg-nest":{},"search-pro":{},"highlight":{},"theme-opendocs":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"preface.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Go语言高级编程","language":"zh-hans","gitbook":"3.x","description":"Go语言高级编程"},"file":{"path":"ch3-asm/ch3-03-const-and-var.md","mtime":"2019-03-26T06:39:21.135Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-03-26T06:40:10.668Z"},"basePath":"..","book":{"language":""}});
})();
</script>

        
    </body>
</html>

