
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>6.7 分布式爬虫 · Go语言高级编程</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">


    
    <link rel="next" href="ch6-08-ext.html" />
    
    
    <link rel="prev" href="ch6-06-config.html" />
    

    </head>
    <body>
        
<div class="gb-page-wrapper">
    <header class="gb-page-header">
        <div class="container">
        
            <a href=".." class="logo">
                <img src="../gitbook/images/logo/64.png">
                <h1>Go语言高级编程</h1>
            </a>

            

            <div class="page_search_block">
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                
                <a href="ch6-08-ext.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-right"></i>
                </a>
                
                
                <a href="ch6-06-config.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-left"></i>
                </a>
                
            
            </div>
        
        </div>
    </header>

    <div class="gb-page-body">
        <div class="gb-page-inner">
            <div class="container">
                <div class="row">
                    <div class="col-md-3">
                        



    
    <div class="panel panel-default ">
        

        <div class="list-group">
            
    
        
        <a href="../" class="list-group-item ">
        

            

            

            Introduction

        
        </a>
        

        
    
        
        <a href="../ch1-basic/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第1章 语言基础

        
        </a>
        

        
    
        
        <a href="../ch2-cgo/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第2章 CGO编程

        
        </a>
        

        
    
        
        <a href="../ch3-asm/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第3章 汇编语言

        
        </a>
        

        
    
        
        <a href="../ch4-rpc/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第4章 RPC和Protobuf

        
        </a>
        

        
    
        
        <a href="../ch5-web/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            第5章 Go和Web

        
        </a>
        

        
    
        
        <a href="readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-down"></i>
            

            第6章 分布式系统

        
        </a>
        

        
        
    
        
        <a href="ch6-01-dist-id.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            6.1 分布式 id 生成器

        
        </a>
        

        
    
        
        <a href="ch6-02-lock.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            6.2 分布式锁

        
        </a>
        

        
    
        
        <a href="ch6-03-delay-job.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            6.3 延时任务系统

        
        </a>
        

        
    
        
        <a href="ch6-04-search-engine.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            6.4 分布式搜索引擎

        
        </a>
        

        
    
        
        <a href="ch6-05-load-balance.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            6.5 负载均衡

        
        </a>
        

        
    
        
        <a href="ch6-06-config.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            6.6 分布式配置管理

        
        </a>
        

        
    
        
        <a href="ch6-07-crawler.html" class="list-group-item active">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            6.7 分布式爬虫

        
        </a>
        

        
    
        
        <a href="ch6-08-ext.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            6.8 补充说明

        
        </a>
        

        
    

        
    
        
        <a href="../appendix/readme.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            附录

        
        </a>
        

        
    

        </div>
    </div>
    



                    </div>
                    <div class="col-md-9">
                        
<div id="book-search-results">
    <div class="search-noresults">
    
                            
                            <div class="gb-markdown book-page-inner">
                                <h1 id="67-&#x5206;&#x5E03;&#x5F0F;&#x722C;&#x866B;">6.7 &#x5206;&#x5E03;&#x5F0F;&#x722C;&#x866B;</h1>
<p>&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x7684;&#x4FE1;&#x606F;&#x7206;&#x70B8;&#x662F;&#x5F88;&#x591A;&#x4EBA;&#x500D;&#x611F;&#x5934;&#x75DB;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5E94;&#x63A5;&#x4E0D;&#x6687;&#x7684;&#x65B0;&#x95FB;&#x3001;&#x4FE1;&#x606F;&#x3001;&#x89C6;&#x9891;&#xFF0C;&#x65E0;&#x5B54;&#x4E0D;&#x5165;&#x5730;&#x4FB5;&#x5360;&#x7740;&#x6211;&#x4EEC;&#x7684;&#x788E;&#x7247;&#x65F6;&#x95F4;&#x3002;&#x4F46;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x771F;&#x6B63;&#x9700;&#x8981;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5374;&#x611F;&#x89C9;&#x6570;&#x636E;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x83B7;&#x53D6;&#x7684;&#x3002;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x5206;&#x6790;&#x73B0;&#x5728;&#x4EBA;&#x5728;&#x8BA8;&#x8BBA;&#x4E9B;&#x4EC0;&#x4E48;&#xFF0C;&#x5173;&#x5FC3;&#x4E9B;&#x4EC0;&#x4E48;&#x3002;&#x751A;&#x81F3;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x80FD;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x6682;&#x65F6;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x53BB;&#x4E00;&#x4E00;&#x9605;&#x89C8;&#x5FC3;&#x4EEA;&#x7684;&#x5C0F;&#x8BF4;&#xFF0C;&#x4F46;&#x53C8;&#x60F3;&#x80FD;&#x7528;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x628A;&#x5B83;&#x4EEC;&#x5B58;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x8D44;&#x6599;&#x5E93;&#x91CC;&#x3002;&#x54EA;&#x6015;&#x662F;&#x51E0;&#x4E2A;&#x6708;&#x6216;&#x4E00;&#x5E74;&#x540E;&#x518D;&#x6765;&#x56DE;&#x987E;&#x3002;&#x518D;&#x6216;&#x8005;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x628A;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x8FD9;&#x4E9B;&#x7A0D;&#x7EB5;&#x5373;&#x901D;&#x7684;&#x6709;&#x7528;&#x4FE1;&#x606F;&#x4FDD;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x4F8B;&#x5982;&#x67D0;&#x4E2A;&#x975E;&#x5E38;&#x5C0F;&#x7684;&#x8BBA;&#x575B;&#x4E2D;&#x805A;&#x96C6;&#x7684;&#x540C;&#x597D;&#x4EEC;&#x7684;&#x9AD8;&#x8D28;&#x91CF;&#x8BA8;&#x8BBA;&#xFF0C;&#x5728;&#x672A;&#x6765;&#x67D0;&#x4E2A;&#x65F6;&#x523B;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x4E9B;&#x5C0F;&#x4F17;&#x7684;&#x805A;&#x96C6;&#x533A;&#x65E0;&#x4EE5;&#x4E3A;&#x7EE7;&#x65F6;&#xFF0C;&#x4F9D;&#x7136;&#x80FD;&#x8BA9;&#x6211;&#x4EEC;&#x4ECE;&#x786C;&#x76D8;&#x4E2D;&#x7FFB;&#x51FA;&#x5F53;&#x521D;&#x73CD;&#x8D35;&#x7684;&#x89C2;&#x70B9;&#x6765;&#x3002;</p>
<p>&#x9664;&#x53BB;&#x60C5;&#x6000;&#x9700;&#x6C42;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x6709;&#x5927;&#x91CF;&#x73CD;&#x8D35;&#x7684;&#x5F00;&#x653E;&#x8D44;&#x6599;&#xFF0C;&#x8FD1;&#x5E74;&#x6765;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5982;&#x96E8;&#x540E;&#x6625;&#x7B0B;&#x4E00;&#x822C;&#x706B;&#x70ED;&#x8D77;&#x6765;&#xFF0C;&#x4F46;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x5E76;&#x4E0D;&#x662F;&#x82E6;&#x4E8E;&#x6211;&#x7684;&#x6A21;&#x578B;&#x662F;&#x5426;&#x5EFA;&#x7ACB;&#x5F97;&#x5408;&#x9002;&#xFF0C;&#x6211;&#x7684;&#x53C2;&#x6570;&#x662F;&#x5426;&#x8C03;&#x6574;&#x5F97;&#x6B63;&#x786E;&#xFF0C;&#x800C;&#x662F;&#x82E6;&#x4E8E;&#x6700;&#x521D;&#x7684;&#x8D77;&#x6B65;&#x9636;&#x6BB5;&#xFF1A;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x6536;&#x96C6;&#x6570;&#x636E;&#x7684;&#x524D;&#x7F6E;&#x5DE5;&#x4F5C;&#xFF0C;&#x6709;&#x80FD;&#x529B;&#x53BB;&#x5199;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6216;&#x8005;&#x590D;&#x6742;&#x7684;&#x722C;&#x866B;&#xFF0C;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x6765;&#x8BF4;&#x4F9D;&#x7136;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;</p>
<h2 id="671-&#x57FA;&#x4E8E;colly&#x7684;&#x5355;&#x673A;&#x722C;&#x866B;">6.7.1 &#x57FA;&#x4E8E;colly&#x7684;&#x5355;&#x673A;&#x722C;&#x866B;</h2>
<p>&#x300A;Go &#x8BED;&#x8A00;&#x7F16;&#x7A0B;&#x300B;&#x4E00;&#x4E66;&#x7ED9;&#x51FA;&#x4E86;&#x7B80;&#x5355;&#x7684;&#x722C;&#x866B;&#x793A;&#x4F8B;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E86;&#x591A;&#x5E74;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x73B0;&#x5728;&#x4F7F;&#x7528;Go&#x8BED;&#x8A00;&#x5199;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x7684;&#x722C;&#x866B;&#x8981;&#x66F4;&#x52A0;&#x65B9;&#x4FBF;&#xFF0C;&#x6BD4;&#x5982;&#x7528;colly&#x6765;&#x5B9E;&#x73B0;&#x722C;&#x53D6;&#x67D0;&#x7F51;&#x7AD9;&#xFF08;&#x865A;&#x62DF;&#x7AD9;&#x70B9;&#xFF0C;&#x8FD9;&#x91CC;&#x7528;abcdefg&#x4F5C;&#x4E3A;&#x5360;&#x4F4D;&#x7B26;&#xFF09;&#x5728;Go&#x8BED;&#x8A00;&#x6807;&#x7B7E;&#x4E0B;&#x7684;&#x524D;&#x5341;&#x9875;&#x5185;&#x5BB9;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">package</span> main

<span class="hljs-keyword">import</span> (
    <span class="hljs-string">&quot;fmt&quot;</span>
    <span class="hljs-string">&quot;regexp&quot;</span>
    <span class="hljs-string">&quot;time&quot;</span>

    <span class="hljs-string">&quot;github.com/gocolly/colly&quot;</span>
)

<span class="hljs-keyword">var</span> visited = <span class="hljs-keyword">map</span>[<span class="hljs-keyword">string</span>]<span class="hljs-keyword">bool</span>{}

<span class="hljs-keyword">func</span> main() {
    <span class="hljs-comment">// Instantiate default collector</span>
    c := colly.NewCollector(
        colly.AllowedDomains(<span class="hljs-string">&quot;www.abcdefg.com&quot;</span>),
        colly.MaxDepth(<span class="hljs-number">1</span>),
    )

    <span class="hljs-comment">// &#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x5339;&#x914D;&#x8BE5;&#x6A21;&#x5F0F;&#x7684;&#x662F;&#x8BE5;&#x7F51;&#x7AD9;&#x7684;&#x8BE6;&#x60C5;&#x9875;</span>
    detailRegex, _ := regexp.Compile(<span class="hljs-string">`/go/go\?p=\d+$`</span>)
    <span class="hljs-comment">// &#x5339;&#x914D;&#x4E0B;&#x9762;&#x6A21;&#x5F0F;&#x7684;&#x662F;&#x8BE5;&#x7F51;&#x7AD9;&#x7684;&#x5217;&#x8868;&#x9875;</span>
    listRegex, _ := regexp.Compile(<span class="hljs-string">`/t/\d+#\w+`</span>)

    <span class="hljs-comment">// &#x6240;&#x6709;a&#x6807;&#x7B7E;&#xFF0C;&#x4E0A;&#x8BBE;&#x7F6E;&#x56DE;&#x8C03;&#x51FD;&#x6570;</span>
    c.OnHTML(<span class="hljs-string">&quot;a[href]&quot;</span>, <span class="hljs-keyword">func</span>(e *colly.HTMLElement) {
        link := e.Attr(<span class="hljs-string">&quot;href&quot;</span>)

        <span class="hljs-comment">// &#x5DF2;&#x8BBF;&#x95EE;&#x8FC7;&#x7684;&#x8BE6;&#x60C5;&#x9875;&#x6216;&#x5217;&#x8868;&#x9875;&#xFF0C;&#x8DF3;&#x8FC7;</span>
        <span class="hljs-keyword">if</span> visited[link] &amp;&amp; (detailRegex.Match([]<span class="hljs-keyword">byte</span>(link)) || listRegex.Match([]<span class="hljs-keyword">byte</span>(link))) {
            <span class="hljs-keyword">return</span>
        }

        <span class="hljs-comment">// &#x65E2;&#x4E0D;&#x662F;&#x5217;&#x8868;&#x9875;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x8BE6;&#x60C5;&#x9875;</span>
        <span class="hljs-comment">// &#x90A3;&#x4E48;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x5173;&#x5FC3;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8981;&#x8DF3;&#x8FC7;</span>
        <span class="hljs-keyword">if</span> !detailRegex.Match([]<span class="hljs-keyword">byte</span>(link)) &amp;&amp; !listRegex.Match([]<span class="hljs-keyword">byte</span>(link)) {
            <span class="hljs-built_in">println</span>(<span class="hljs-string">&quot;not match&quot;</span>, link)
            <span class="hljs-keyword">return</span>
        }

        <span class="hljs-comment">// &#x56E0;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x7F51;&#x7AD9;&#x6709;&#x53CD;&#x722C;&#x866B;&#x7B56;&#x7565;</span>
        <span class="hljs-comment">// &#x6240;&#x4EE5;&#x722C;&#x866B;&#x903B;&#x8F91;&#x4E2D;&#x5E94;&#x8BE5;&#x6709; sleep &#x903B;&#x8F91;&#x4EE5;&#x907F;&#x514D;&#x88AB;&#x5C01;&#x6740;</span>
        time.Sleep(time.Second)
        <span class="hljs-built_in">println</span>(<span class="hljs-string">&quot;match&quot;</span>, link)

        visited[link] = <span class="hljs-literal">true</span>

        time.Sleep(time.Millisecond * <span class="hljs-number">2</span>)
        c.Visit(e.Request.AbsoluteURL(link))
    })

    err := c.Visit(<span class="hljs-string">&quot;https://www.abcdefg.com/go/go&quot;</span>)
    <span class="hljs-keyword">if</span> err != <span class="hljs-literal">nil</span> {fmt.Println(err)}
}
</code></pre>
<h2 id="672-&#x5206;&#x5E03;&#x5F0F;&#x722C;&#x866B;">6.7.2 &#x5206;&#x5E03;&#x5F0F;&#x722C;&#x866B;</h2>
<p>&#x60F3;&#x50CF;&#x4E00;&#x4E0B;&#xFF0C;&#x4F60;&#x4EEC;&#x7684;&#x4FE1;&#x606F;&#x5206;&#x6790;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x975E;&#x5E38;&#x4E4B;&#x5FEB;&#x3002;&#x83B7;&#x53D6;&#x4FE1;&#x606F;&#x7684;&#x901F;&#x5EA6;&#x6210;&#x4E3A;&#x4E86;&#x74F6;&#x9888;&#xFF0C;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x7528;&#x4E0A;Go&#x8BED;&#x8A00;&#x6240;&#x6709;&#x4F18;&#x79C0;&#x7684;&#x5E76;&#x53D1;&#x7279;&#x6027;&#xFF0C;&#x5C06;&#x5355;&#x673A;&#x7684;CPU&#x548C;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x90FD;&#x7528;&#x6EE1;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x52A0;&#x5FEB;&#x722C;&#x866B;&#x7684;&#x722C;&#x53D6;&#x901F;&#x5EA6;&#x3002;&#x5728;&#x5F88;&#x591A;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x901F;&#x5EA6;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF1A;</p>
<ol>
<li>&#x5BF9;&#x4E8E;&#x4EF7;&#x683C;&#x6218;&#x671F;&#x95F4;&#x7684;&#x7535;&#x5546;&#x4EEC;&#x6765;&#x8BF4;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5728;&#x5BF9;&#x624B;&#x4EF7;&#x683C;&#x53D8;&#x52A8;&#x540E;&#x7B2C;&#x4E00;&#x65F6;&#x95F4;&#x83B7;&#x53D6;&#x5230;&#x5176;&#x6700;&#x65B0;&#x4EF7;&#x683C;&#xFF0C;&#x518D;&#x9760;&#x673A;&#x5668;&#x81EA;&#x52A8;&#x8C03;&#x6574;&#x672C;&#x5BB6;&#x7684;&#x5546;&#x54C1;&#x4EF7;&#x683C;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x7C7B;&#x4F3C;&#x5934;&#x6761;&#x4E4B;&#x7C7B;&#x7684;Feed&#x6D41;&#x4E1A;&#x52A1;&#xFF0C;&#x4FE1;&#x606F;&#x7684;&#x65F6;&#x6548;&#x6027;&#x4E5F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6162;&#x541E;&#x541E;&#x5730;&#x722C;&#x5230;&#x7684;&#x65B0;&#x95FB;&#x662F;&#x6628;&#x5929;&#x7684;&#x65B0;&#x95FB;&#xFF0C;&#x90A3;&#x5BF9;&#x4E8E;&#x7528;&#x6237;&#x6765;&#x8BF4;&#x5C31;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x610F;&#x4E49;&#x3002;</li>
</ol>
<p>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5206;&#x5E03;&#x5F0F;&#x722C;&#x866B;&#x3002;&#x4ECE;&#x672C;&#x8D28;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#x722C;&#x866B;&#x662F;&#x4E00;&#x5957;&#x4EFB;&#x52A1;&#x5206;&#x53D1;&#x548C;&#x6267;&#x884C;&#x7CFB;&#x7EDF;&#x3002;&#x800C;&#x5E38;&#x89C1;&#x7684;&#x4EFB;&#x52A1;&#x5206;&#x53D1;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0A;&#x4E0B;&#x6E38;&#x5B58;&#x5728;&#x901F;&#x5EA6;&#x4E0D;&#x5339;&#x914D;&#x95EE;&#x9898;&#xFF0C;&#x5FC5;&#x7136;&#x8981;&#x501F;&#x52A9;&#x6D88;&#x606F;&#x961F;&#x5217;&#x3002;</p>
<p><img src="../images/ch6-dist-crawler.png" alt="dist-crawler"></p>
<p><em>&#x56FE; 6-14 &#x722C;&#x866B;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;</em></p>
<p>&#x4E0A;&#x6E38;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x662F;&#x6839;&#x636E;&#x9884;&#x5148;&#x914D;&#x7F6E;&#x597D;&#x7684;&#x8D77;&#x70B9;&#x6765;&#x722C;&#x53D6;&#x6240;&#x6709;&#x7684;&#x76EE;&#x6807;&#x201C;&#x5217;&#x8868;&#x9875;&#x201D;&#xFF0C;&#x5217;&#x8868;&#x9875;&#x7684;html&#x5185;&#x5BB9;&#x4E2D;&#x4F1A;&#x5305;&#x542B;&#x6709;&#x6240;&#x6709;&#x8BE6;&#x60C5;&#x9875;&#x7684;&#x94FE;&#x63A5;&#x3002;&#x8BE6;&#x60C5;&#x9875;&#x7684;&#x6570;&#x91CF;&#x4E00;&#x822C;&#x662F;&#x5217;&#x8868;&#x9875;&#x7684;10&#x5230;100&#x500D;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C06;&#x8FD9;&#x4E9B;&#x8BE6;&#x60C5;&#x9875;&#x94FE;&#x63A5;&#x4F5C;&#x4E3A;&#x201C;&#x4EFB;&#x52A1;&#x201D;&#x5185;&#x5BB9;&#xFF0C;&#x901A;&#x8FC7;&#x6D88;&#x606F;&#x961F;&#x5217;&#x5206;&#x53D1;&#x51FA;&#x53BB;&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x9875;&#x9762;&#x722C;&#x53D6;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x6267;&#x884C;&#x65F6;&#x662F;&#x5426;&#x5076;&#x5C14;&#x4F1A;&#x6709;&#x91CD;&#x590D;&#x5176;&#x5B9E;&#x4E0D;&#x592A;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x4EFB;&#x52A1;&#x7ED3;&#x679C;&#x662F;&#x5E42;&#x7B49;&#x7684;&#xFF08;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x53EA;&#x722C;&#x9875;&#x9762;&#x5185;&#x5BB9;&#xFF0C;&#x4E0D;&#x8003;&#x8651;&#x8BC4;&#x8BBA;&#x90E8;&#x5206;&#xFF09;&#x3002;</p>
<p>&#x672C;&#x8282;&#x6211;&#x4EEC;&#x6765;&#x7B80;&#x5355;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;&#x6D88;&#x606F;&#x961F;&#x5217;&#x7684;&#x722C;&#x866B;&#xFF0C;&#x672C;&#x8282;&#x6211;&#x4EEC;&#x4F7F;&#x7528;nats&#x6765;&#x505A;&#x4EFB;&#x52A1;&#x5206;&#x53D1;&#x3002;&#x5B9E;&#x9645;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x5E94;&#x8BE5;&#x9488;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x4E1A;&#x52A1;&#x5BF9;&#x6D88;&#x606F;&#x672C;&#x8EAB;&#x7684;&#x53EF;&#x9760;&#x6027;&#x8981;&#x6C42;&#x548C;&#x516C;&#x53F8;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x7EC4;&#x4EF6;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x9009;&#x578B;&#x3002;</p>
<h3 id="6721-nats&#x7B80;&#x4ECB;">6.7.2.1 nats&#x7B80;&#x4ECB;</h3>
<p>nats&#x662F;Go&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x4E2A;&#x9AD8;&#x6027;&#x80FD;&#x5206;&#x5E03;&#x5F0F;&#x6D88;&#x606F;&#x961F;&#x5217;&#xFF0C;&#x9002;&#x7528;&#x4E8E;&#x9AD8;&#x5E76;&#x53D1;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x7684;&#x6D88;&#x606F;&#x5206;&#x53D1;&#x573A;&#x666F;&#x3002;&#x65E9;&#x671F;&#x7684;nats&#x4EE5;&#x901F;&#x5EA6;&#x4E3A;&#x91CD;&#xFF0C;&#x6CA1;&#x6709;&#x652F;&#x6301;&#x6301;&#x4E45;&#x5316;&#x3002;&#x4ECE;16&#x5E74;&#x5F00;&#x59CB;&#xFF0C;nats&#x901A;&#x8FC7;nats-streaming&#x652F;&#x6301;&#x57FA;&#x4E8E;&#x65E5;&#x5FD7;&#x7684;&#x6301;&#x4E45;&#x5316;&#xFF0C;&#x4EE5;&#x53CA;&#x53EF;&#x9760;&#x7684;&#x6D88;&#x606F;&#x4F20;&#x8F93;&#x3002;&#x4E3A;&#x4E86;&#x6F14;&#x793A;&#x65B9;&#x4FBF;&#xFF0C;&#x6211;&#x4EEC;&#x672C;&#x8282;&#x4E2D;&#x53EA;&#x4F7F;&#x7528;nats&#x3002;</p>
<p>nats&#x7684;&#x670D;&#x52A1;&#x7AEF;&#x9879;&#x76EE;&#x662F;gnatsd&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x4E0E;gnatsd&#x7684;&#x901A;&#x4FE1;&#x65B9;&#x5F0F;&#x4E3A;&#x57FA;&#x4E8E;tcp&#x7684;&#x6587;&#x672C;&#x534F;&#x8BAE;&#xFF0C;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF1A;</p>
<p>&#x5411;subject&#x4E3A;task&#x53D1;&#x6D88;&#x606F;&#xFF1A;</p>
<p><img src="../images/ch6-09-nats-protocol-pub.png" alt="nats-protocol-pub"></p>
<p><em>&#x56FE; 6-15 nats&#x534F;&#x8BAE;&#x4E2D;&#x7684;pub</em></p>
<p>&#x4EE5;workers&#x7684;queue&#x4ECE;tasks subject&#x8BA2;&#x9605;&#x6D88;&#x606F;&#xFF1A;</p>
<p><img src="../images/ch6-09-nats-protocol-sub.png" alt="nats-protocol-sub"></p>
<p><em>&#x56FE; 6-16 nats&#x534F;&#x8BAE;&#x4E2D;&#x7684;sub</em></p>
<p>&#x5176;&#x4E2D;&#x7684;queue&#x53C2;&#x6570;&#x662F;&#x53EF;&#x9009;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5E0C;&#x671B;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x6D88;&#x8D39;&#x7AEF;&#x8FDB;&#x884C;&#x4EFB;&#x52A1;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x6536;&#x5230;&#x540C;&#x6837;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x7ED9;&#x6D88;&#x8D39;&#x7AEF;&#x6307;&#x5B9A;&#x76F8;&#x540C;&#x7684;queue&#x540D;&#x5B57;&#x3002;</p>
<h4 id="&#x57FA;&#x672C;&#x6D88;&#x606F;&#x751F;&#x4EA7;">&#x57FA;&#x672C;&#x6D88;&#x606F;&#x751F;&#x4EA7;</h4>
<p>&#x751F;&#x4EA7;&#x6D88;&#x606F;&#x53EA;&#x8981;&#x6307;&#x5B9A;subject&#x5373;&#x53EF;&#xFF1A;</p>
<pre><code class="lang-go">nc, err := nats.Connect(nats.DefaultURL)
<span class="hljs-keyword">if</span> err != <span class="hljs-literal">nil</span> {<span class="hljs-keyword">return</span>}

<span class="hljs-comment">// &#x6307;&#x5B9A; subject &#x4E3A; tasks&#xFF0C;&#x6D88;&#x606F;&#x5185;&#x5BB9;&#x968F;&#x610F;</span>
err = nc.Publish(<span class="hljs-string">&quot;tasks&quot;</span>, []<span class="hljs-keyword">byte</span>(<span class="hljs-string">&quot;your task content&quot;</span>))

nc.Flush()
</code></pre>
<h4 id="&#x57FA;&#x672C;&#x6D88;&#x606F;&#x6D88;&#x8D39;">&#x57FA;&#x672C;&#x6D88;&#x606F;&#x6D88;&#x8D39;</h4>
<p>&#x76F4;&#x63A5;&#x4F7F;&#x7528;nats&#x7684;subscribe API&#x5E76;&#x4E0D;&#x80FD;&#x8FBE;&#x5230;&#x4EFB;&#x52A1;&#x5206;&#x53D1;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;pub sub&#x672C;&#x8EAB;&#x662F;&#x5E7F;&#x64AD;&#x6027;&#x8D28;&#x7684;&#x3002;&#x6240;&#x6709;&#x6D88;&#x8D39;&#x8005;&#x90FD;&#x4F1A;&#x6536;&#x5230;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x7684;&#x6240;&#x6709;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x666E;&#x901A;&#x7684;subscribe&#x4E4B;&#x5916;&#xFF0C;nats&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;queue subscribe&#x7684;&#x529F;&#x80FD;&#x3002;&#x53EA;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;queue group&#x540D;&#x5B57;&#xFF08;&#x7C7B;&#x4F3C;Kafka&#x4E2D;&#x7684;consumer group&#xFF09;&#xFF0C;&#x5373;&#x53EF;&#x5747;&#x8861;&#x5730;&#x5C06;&#x4EFB;&#x52A1;&#x5206;&#x53D1;&#x7ED9;&#x6D88;&#x8D39;&#x8005;&#x3002;</p>
<pre><code class="lang-go">nc, err := nats.Connect(nats.DefaultURL)
<span class="hljs-keyword">if</span> err != <span class="hljs-literal">nil</span> {<span class="hljs-keyword">return</span>}

<span class="hljs-comment">// queue subscribe &#x76F8;&#x5F53;&#x4E8E;&#x5728;&#x6D88;&#x8D39;&#x8005;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x4EFB;&#x52A1;&#x5206;&#x53D1;&#x7684;&#x5206;&#x652F;&#x5747;&#x8861;</span>
<span class="hljs-comment">// &#x524D;&#x63D0;&#x662F;&#x6240;&#x6709;&#x6D88;&#x8D39;&#x8005;&#x90FD;&#x4F7F;&#x7528; workers &#x8FD9;&#x4E2A; queue</span>
<span class="hljs-comment">// nats &#x4E2D;&#x7684; queue &#x6982;&#x5FF5;&#x4E0A;&#x7C7B;&#x4F3C;&#x4E8E; Kafka &#x4E2D;&#x7684; consumer group</span>
sub, err := nc.QueueSubscribeSync(<span class="hljs-string">&quot;tasks&quot;</span>, <span class="hljs-string">&quot;workers&quot;</span>)
<span class="hljs-keyword">if</span> err != <span class="hljs-literal">nil</span> {<span class="hljs-keyword">return</span>}

<span class="hljs-keyword">var</span> msg *nats.Msg
<span class="hljs-keyword">for</span> {
    msg, err = sub.NextMsg(time.Hour * <span class="hljs-number">10000</span>)
    <span class="hljs-keyword">if</span> err != <span class="hljs-literal">nil</span> {<span class="hljs-keyword">break</span>}
    <span class="hljs-comment">// &#x6B63;&#x786E;&#x5730;&#x6D88;&#x8D39;&#x5230;&#x4E86;&#x6D88;&#x606F;</span>
    <span class="hljs-comment">// &#x53EF;&#x7528; nats.Msg &#x5BF9;&#x8C61;&#x5904;&#x7406;&#x4EFB;&#x52A1;</span>
}
</code></pre>
<h2 id="673-&#x7ED3;&#x5408;nats&#x548C;colly&#x7684;&#x6D88;&#x606F;&#x751F;&#x4EA7;">6.7.3 &#x7ED3;&#x5408;nats&#x548C;colly&#x7684;&#x6D88;&#x606F;&#x751F;&#x4EA7;</h2>
<p>&#x6211;&#x4EEC;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x5B9A;&#x5236;&#x4E00;&#x4E2A;&#x5BF9;&#x5E94;&#x7684;collector&#xFF0C;&#x5E76;&#x8BBE;&#x7F6E;&#x76F8;&#x5E94;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x6BD4;&#x5982;abcdefg&#xFF0C;hijklmn&#xFF08;&#x865A;&#x6784;&#x7684;&#xFF09;&#xFF0C;&#x518D;&#x7528;&#x7B80;&#x5355;&#x7684;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6765;&#x5C06;&#x8BE5;collector&#x548C;&#x5176;host&#x5BF9;&#x5E94;&#x8D77;&#x6765;&#xFF0C;&#x6BCF;&#x4E2A;&#x7AD9;&#x70B9;&#x722C;&#x5230;&#x5217;&#x8868;&#x9875;&#x4E4B;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x5F53;&#x524D;&#x7A0B;&#x5E8F;&#x4E2D;&#x628A;&#x6240;&#x6709;&#x94FE;&#x63A5;&#x89E3;&#x6790;&#x51FA;&#x6765;&#xFF0C;&#x5E76;&#x628A;&#x843D;&#x5730;&#x9875;&#x7684;URL&#x53D1;&#x5F80;&#x6D88;&#x606F;&#x961F;&#x5217;&#x3002;</p>
<pre><code class="lang-go"><span class="hljs-keyword">package</span> main

<span class="hljs-keyword">import</span> (
    <span class="hljs-string">&quot;fmt&quot;</span>
    <span class="hljs-string">&quot;net/url&quot;</span>

    <span class="hljs-string">&quot;github.com/gocolly/colly&quot;</span>
)

<span class="hljs-keyword">var</span> domain2Collector = <span class="hljs-keyword">map</span>[<span class="hljs-keyword">string</span>]*colly.Collector{}
<span class="hljs-keyword">var</span> nc *nats.Conn
<span class="hljs-keyword">var</span> maxDepth = <span class="hljs-number">10</span>
<span class="hljs-keyword">var</span> natsURL = <span class="hljs-string">&quot;nats://localhost:4222&quot;</span>

<span class="hljs-keyword">func</span> factory(urlStr <span class="hljs-keyword">string</span>) *colly.Collector {
    u, _ := url.Parse(urlStr)
    <span class="hljs-keyword">return</span> domain2Collector[u.Host]
}

<span class="hljs-keyword">func</span> initABCDECollector() *colly.Collector {
    c := colly.NewCollector(
        colly.AllowedDomains(<span class="hljs-string">&quot;www.abcdefg.com&quot;</span>),
        colly.MaxDepth(maxDepth),
    )

    c.OnResponse(<span class="hljs-keyword">func</span>(resp *colly.Response) {
        <span class="hljs-comment">// &#x505A;&#x4E00;&#x4E9B;&#x722C;&#x5B8C;&#x4E4B;&#x540E;&#x7684;&#x5584;&#x540E;&#x5DE5;&#x4F5C;</span>
        <span class="hljs-comment">// &#x6BD4;&#x5982;&#x9875;&#x9762;&#x5DF2;&#x722C;&#x5B8C;&#x7684;&#x786E;&#x8BA4;&#x5B58;&#x8FDB; MySQL</span>
    })

    c.OnHTML(<span class="hljs-string">&quot;a[href]&quot;</span>, <span class="hljs-keyword">func</span>(e *colly.HTMLElement) {
        <span class="hljs-comment">// &#x57FA;&#x672C;&#x7684;&#x53CD;&#x722C;&#x866B;&#x7B56;&#x7565;</span>
        link := e.Attr(<span class="hljs-string">&quot;href&quot;</span>)
        time.Sleep(time.Second * <span class="hljs-number">2</span>)

        <span class="hljs-comment">// &#x6B63;&#x5219; match &#x5217;&#x8868;&#x9875;&#x7684;&#x8BDD;&#xFF0C;&#x5C31; visit</span>
        <span class="hljs-keyword">if</span> listRegex.Match([]<span class="hljs-keyword">byte</span>(link)) {
            c.Visit(e.Request.AbsoluteURL(link))
        }
        <span class="hljs-comment">// &#x6B63;&#x5219; match &#x843D;&#x5730;&#x9875;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x53D1;&#x6D88;&#x606F;&#x961F;&#x5217;</span>
        <span class="hljs-keyword">if</span> detailRegex.Match([]<span class="hljs-keyword">byte</span>(link)) {
            err = nc.Publish(<span class="hljs-string">&quot;tasks&quot;</span>, []<span class="hljs-keyword">byte</span>(link))
            nc.Flush()
        }
    })
    <span class="hljs-keyword">return</span> c
}

<span class="hljs-keyword">func</span> initHIJKLCollector() *colly.Collector {
    c := colly.NewCollector(
        colly.AllowedDomains(<span class="hljs-string">&quot;www.hijklmn.com&quot;</span>),
        colly.MaxDepth(maxDepth),
    )

    c.OnHTML(<span class="hljs-string">&quot;a[href]&quot;</span>, <span class="hljs-keyword">func</span>(e *colly.HTMLElement) {
    })

    <span class="hljs-keyword">return</span> c
}

<span class="hljs-keyword">func</span> init() {
    domain2Collector[<span class="hljs-string">&quot;www.abcdefg.com&quot;</span>] = initV2exCollector()
    domain2Collector[<span class="hljs-string">&quot;www.hijklmn.com&quot;</span>] = initV2fxCollector()

    <span class="hljs-keyword">var</span> err error
    nc, err = nats.Connect(natsURL)
    <span class="hljs-keyword">if</span> err != <span class="hljs-literal">nil</span> {os.Exit(<span class="hljs-number">1</span>)}
}

<span class="hljs-keyword">func</span> main() {
    urls := []<span class="hljs-keyword">string</span>{<span class="hljs-string">&quot;https://www.abcdefg.com&quot;</span>, <span class="hljs-string">&quot;https://www.hijklmn.com&quot;</span>}
    <span class="hljs-keyword">for</span> _, url := <span class="hljs-keyword">range</span> urls {
        instance := factory(url)
        instance.Visit(url)
    }
}
</code></pre>
<h2 id="674-&#x7ED3;&#x5408;colly&#x7684;&#x6D88;&#x606F;&#x6D88;&#x8D39;">6.7.4 &#x7ED3;&#x5408;colly&#x7684;&#x6D88;&#x606F;&#x6D88;&#x8D39;</h2>
<p>&#x6D88;&#x8D39;&#x7AEF;&#x5C31;&#x7B80;&#x5355;&#x4E00;&#x4E9B;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x8BA2;&#x9605;&#x5BF9;&#x5E94;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x5E76;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x7F51;&#x7AD9;&#x7684;&#x8BE6;&#x60C5;&#x9875;(&#x843D;&#x5730;&#x9875;)&#x5373;&#x53EF;&#x3002;</p>
<pre><code class="lang-go"><span class="hljs-keyword">package</span> main

<span class="hljs-keyword">import</span> (
    <span class="hljs-string">&quot;fmt&quot;</span>
    <span class="hljs-string">&quot;net/url&quot;</span>

    <span class="hljs-string">&quot;github.com/gocolly/colly&quot;</span>
)

<span class="hljs-keyword">var</span> domain2Collector = <span class="hljs-keyword">map</span>[<span class="hljs-keyword">string</span>]*colly.Collector{}
<span class="hljs-keyword">var</span> nc *nats.Conn
<span class="hljs-keyword">var</span> maxDepth = <span class="hljs-number">10</span>
<span class="hljs-keyword">var</span> natsURL = <span class="hljs-string">&quot;nats://localhost:4222&quot;</span>

<span class="hljs-keyword">func</span> factory(urlStr <span class="hljs-keyword">string</span>) *colly.Collector {
    u, _ := url.Parse(urlStr)
    <span class="hljs-keyword">return</span> domain2Collector[u.Host]
}

<span class="hljs-keyword">func</span> initV2exCollector() *colly.Collector {
    c := colly.NewCollector(
        colly.AllowedDomains(<span class="hljs-string">&quot;www.abcdefg.com&quot;</span>),
        colly.MaxDepth(maxDepth),
    )
    <span class="hljs-keyword">return</span> c
}

<span class="hljs-keyword">func</span> initV2fxCollector() *colly.Collector {
    c := colly.NewCollector(
        colly.AllowedDomains(<span class="hljs-string">&quot;www.hijklmn.com&quot;</span>),
        colly.MaxDepth(maxDepth),
    )
    <span class="hljs-keyword">return</span> c
}

<span class="hljs-keyword">func</span> init() {
    domain2Collector[<span class="hljs-string">&quot;www.abcdefg.com&quot;</span>] = initABCDECollector()
    domain2Collector[<span class="hljs-string">&quot;www.hijklmn.com&quot;</span>] = initHIJKLCollector()

    <span class="hljs-keyword">var</span> err error
    nc, err = nats.Connect(natsURL)
    <span class="hljs-keyword">if</span> err != <span class="hljs-literal">nil</span> {os.Exit(<span class="hljs-number">1</span>)}
}

<span class="hljs-keyword">func</span> startConsumer() {
    nc, err := nats.Connect(nats.DefaultURL)
    <span class="hljs-keyword">if</span> err != <span class="hljs-literal">nil</span> {<span class="hljs-keyword">return</span>}

    sub, err := nc.QueueSubscribeSync(<span class="hljs-string">&quot;tasks&quot;</span>, <span class="hljs-string">&quot;workers&quot;</span>)
    <span class="hljs-keyword">if</span> err != <span class="hljs-literal">nil</span> {<span class="hljs-keyword">return</span>}

    <span class="hljs-keyword">var</span> msg *nats.Msg
    <span class="hljs-keyword">for</span> {
        msg, err = sub.NextMsg(time.Hour * <span class="hljs-number">10000</span>)
        <span class="hljs-keyword">if</span> err != <span class="hljs-literal">nil</span> {<span class="hljs-keyword">break</span>}

        urlStr := <span class="hljs-keyword">string</span>(msg.Data)
        ins := factory(urlStr)
        <span class="hljs-comment">// &#x56E0;&#x4E3A;&#x6700;&#x4E0B;&#x6E38;&#x62FF;&#x5230;&#x7684;&#x4E00;&#x5B9A;&#x662F;&#x5BF9;&#x5E94;&#x7F51;&#x7AD9;&#x7684;&#x843D;&#x5730;&#x9875;</span>
        <span class="hljs-comment">// &#x6240;&#x4EE5;&#x4E0D;&#x7528;&#x8FDB;&#x884C;&#x591A;&#x4F59;&#x7684;&#x5224;&#x65AD;&#x4E86;&#xFF0C;&#x76F4;&#x63A5;&#x722C;&#x5185;&#x5BB9;&#x5373;&#x53EF;</span>
        ins.Visit(urlStr)
        <span class="hljs-comment">// &#x9632;&#x6B62;&#x88AB;&#x5C01;&#x6740;</span>
        time.Sleep(time.Second)
    }
}

<span class="hljs-keyword">func</span> main() {
    startConsumer()
}
</code></pre>
<p>&#x4ECE;&#x4EE3;&#x7801;&#x5C42;&#x9762;&#x4E0A;&#x6765;&#x8BB2;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x751F;&#x4EA7;&#x8005;&#x548C;&#x6D88;&#x8D39;&#x8005;&#x5176;&#x5B9E;&#x672C;&#x8D28;&#x4E0A;&#x5DEE;&#x4E0D;&#x591A;&#x3002;&#x5982;&#x679C;&#x65E5;&#x540E;&#x6211;&#x4EEC;&#x8981;&#x7075;&#x6D3B;&#x5730;&#x652F;&#x6301;&#x589E;&#x52A0;&#x3001;&#x51CF;&#x5C11;&#x5404;&#x79CD;&#x7F51;&#x7AD9;&#x7684;&#x722C;&#x53D6;&#x7684;&#x8BDD;&#xFF0C;&#x5E94;&#x8BE5;&#x601D;&#x8003;&#x5982;&#x4F55;&#x5C06;&#x8FD9;&#x4E9B;&#x722C;&#x866B;&#x7684;&#x7B56;&#x7565;&#x3001;&#x53C2;&#x6570;&#x5C3D;&#x91CF;&#x5730;&#x914D;&#x7F6E;&#x5316;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x914D;&#x7F6E;&#x4E00;&#x8282;&#x4E2D;&#x5DF2;&#x7ECF;&#x8BB2;&#x4E86;&#x4E00;&#x4E9B;&#x914D;&#x7F6E;&#x7CFB;&#x7EDF;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x8FDB;&#x884C;&#x5C1D;&#x8BD5;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x518D;&#x8D58;&#x8FF0;&#x4E86;&#x3002;</p>

                            </div>
                            
                        
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                    </div>
                </div>
            </div>
        </div>
    </div>
</div>

<script src="../gitbook/gitbook.js"></script>

    
    <script src="../gitbook/gitbook-plugin-bg-nest/bg-nest.min.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-bg-nest/init.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
    

    
    <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
    

<script>
(function() {
    gitbook.page.hasChanged({"page":{"title":"6.7 分布式爬虫","level":"1.7.7","depth":2,"next":{"title":"6.8 补充说明","level":"1.7.8","depth":2,"path":"ch6-cloud/ch6-08-ext.md","ref":"ch6-cloud/ch6-08-ext.md","articles":[]},"previous":{"title":"6.6 分布式配置管理","level":"1.7.6","depth":2,"path":"ch6-cloud/ch6-06-config.md","ref":"ch6-cloud/ch6-06-config.md","articles":[]},"dir":"ltr"},"config":{"plugins":["theme-opendocs","bg-nest","-lunr","-search","search-pro","-sharing","-fontsettings","ga"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"ga":{"configuration":"auto","token":"UA-131598830-2"},"bg-nest":{},"search-pro":{},"highlight":{},"theme-opendocs":{}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"preface.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Go语言高级编程","language":"zh-hans","gitbook":"3.x","description":"Go语言高级编程"},"file":{"path":"ch6-cloud/ch6-07-crawler.md","mtime":"2019-08-14T08:26:11.925Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-08-14T08:27:10.301Z"},"basePath":"..","book":{"language":""}});
})();
</script>

        
    </body>
</html>

